-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Aug 06, 2023 at 01:00 PM
-- Server version: 10.6.14-MariaDB
-- PHP Version: 8.1.16

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `codexkw_ghars`
--

-- --------------------------------------------------------

--
-- Table structure for table `actions`
--

CREATE TABLE `actions` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` varchar(255) NOT NULL,
  `ar_action` varchar(255) NOT NULL,
  `en_action` varchar(255) NOT NULL,
  `ip` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `actions`
--

INSERT INTO `actions` (`id`, `user_id`, `ar_action`, `en_action`, `ip`, `created_at`, `updated_at`) VALUES
(1, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-05-20 08:43:53', '2023-05-20 08:43:53'),
(2, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-05-20 08:43:54', '2023-05-20 08:43:54'),
(3, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-05-20 08:48:10', '2023-05-20 08:48:10'),
(4, '1', 'قام بتعديل  بيانات حسابه', 'update his profile info', '::1', '2023-05-20 08:57:44', '2023-05-20 08:57:44'),
(5, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-05-20 08:58:55', '2023-05-20 08:58:55'),
(6, '1', 'قام بتعديل إعدادات الموقع', 'Edit site settings ', '::1', '2023-05-20 08:59:50', '2023-05-20 08:59:50'),
(7, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-05-20 08:59:52', '2023-05-20 08:59:52'),
(8, '1', 'قام بفتح صفحة حسابات التواصل الإجتماعي', 'Open Social Media page', '::1', '2023-05-20 08:59:59', '2023-05-20 08:59:59'),
(9, '1', 'قام بتعديل حساب تواصل إجتماعي حالي https://twitter.com/', 'Edit current social media account https://twitter.com/', '::1', '2023-05-20 09:00:04', '2023-05-20 09:00:04'),
(10, '1', 'قام بفتح صفحة حسابات التواصل الإجتماعي', 'Open Social Media page', '::1', '2023-05-20 09:00:04', '2023-05-20 09:00:04'),
(11, '1', 'قام بفتح صفحة الدول', 'Open countries page', '::1', '2023-05-20 09:02:11', '2023-05-20 09:02:11'),
(12, '1', 'قام بتعديل  دولة حالية أفغانستان', 'Edit current country Afghanistan', '::1', '2023-05-20 09:02:57', '2023-05-20 09:02:57'),
(13, '1', 'قام بفتح صفحة الدول', 'Open countries page', '::1', '2023-05-20 09:02:58', '2023-05-20 09:02:58'),
(14, '1', 'قام بفتح صفحة عمليات النظام', 'open log page', '::1', '2023-05-20 09:03:01', '2023-05-20 09:03:01'),
(15, '1', 'قام بفتح صفحة عمليات النظام', 'open log page', '::1', '2023-05-20 09:03:14', '2023-05-20 09:03:14'),
(16, '1', 'قام بفتح صفحة الإشعارات', 'Open notifications page', '::1', '2023-05-20 09:03:22', '2023-05-20 09:03:22'),
(17, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 09:05:01', '2023-05-20 09:05:01'),
(18, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-05-20 09:28:22', '2023-05-20 09:28:22'),
(19, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 09:28:22', '2023-05-20 09:28:22'),
(20, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 09:30:10', '2023-05-20 09:30:10'),
(21, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:30:20', '2023-05-20 09:30:20'),
(22, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:30:46', '2023-05-20 09:30:46'),
(23, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:31:42', '2023-05-20 09:31:42'),
(24, '1', 'قام بتعديل مشرف حالي  ', 'Edit current supervisor  ', '::1', '2023-05-20 09:32:36', '2023-05-20 09:32:36'),
(25, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:32:36', '2023-05-20 09:32:36'),
(26, '1', 'قام بتعديل مشرف حالي  ', 'Edit current supervisor  ', '::1', '2023-05-20 09:32:44', '2023-05-20 09:32:44'),
(27, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:32:44', '2023-05-20 09:32:44'),
(28, '1', 'قام بتعديل  بيانات حسابه', 'update his profile info', '::1', '2023-05-20 09:36:07', '2023-05-20 09:36:07'),
(29, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:36:11', '2023-05-20 09:36:11'),
(30, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:36:39', '2023-05-20 09:36:39'),
(31, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:36:49', '2023-05-20 09:36:49'),
(32, '1', 'قام بتعديل مشرف حالي  ', 'Edit current supervisor  ', '::1', '2023-05-20 09:37:23', '2023-05-20 09:37:23'),
(33, '1', 'قام بفتح صفحة المشرفين', 'Open supervisors page', '::1', '2023-05-20 09:37:23', '2023-05-20 09:37:23'),
(34, '1', 'قام بفتح صفحة أعضاء التطبيقات', 'Open application users page', '::1', '2023-05-20 09:41:13', '2023-05-20 09:41:13'),
(35, '1', 'قام بإضافة عضو جديد بالتطبيق test user', 'Add new application user test user', '::1', '2023-05-20 09:42:19', '2023-05-20 09:42:19'),
(36, '1', 'قام بفتح صفحة أعضاء التطبيقات', 'Open application users page', '::1', '2023-05-20 09:42:22', '2023-05-20 09:42:22'),
(37, '1', 'قام بفتح صفحة الإعلانات', 'Open ads page', '::1', '2023-05-20 09:45:30', '2023-05-20 09:45:30'),
(38, '1', 'قام بإضافة صورة جديدة بالإعلانات اعلان ١', 'Add new ads Ads 1', '::1', '2023-05-20 09:46:13', '2023-05-20 09:46:13'),
(39, '1', 'قام بفتح صفحة الإعلانات', 'Open ads page', '::1', '2023-05-20 09:46:17', '2023-05-20 09:46:17'),
(40, '1', 'قام بتعديل  صورة حالية بالإعلانات اعلان ١', 'Edit current ads Ads 1', '::1', '2023-05-20 09:47:02', '2023-05-20 09:47:02'),
(41, '1', 'قام بفتح صفحة الإعلانات', 'Open ads page', '::1', '2023-05-20 09:47:02', '2023-05-20 09:47:02'),
(42, '1', 'قام بإضافة صورة جديدة بعارض الصور هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها', 'Add new slider It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout', '::1', '2023-05-20 09:50:50', '2023-05-20 09:50:50'),
(43, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-05-20 09:50:52', '2023-05-20 09:50:52'),
(44, '1', 'قام بحذف صورة حالية بعارض الصور عنوان', 'Delete current slider Title', '::1', '2023-05-20 09:52:41', '2023-05-20 09:52:41'),
(45, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-05-20 09:52:41', '2023-05-20 09:52:41'),
(46, '1', 'قام بتعديل  صورة حالية بعارض الصور هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها', 'Edit current slider It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout', '::1', '2023-05-20 09:52:48', '2023-05-20 09:52:48'),
(47, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-05-20 09:52:48', '2023-05-20 09:52:48'),
(48, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-05-20 09:53:12', '2023-05-20 09:53:12'),
(49, '1', 'قام بفتح صفحة الإعلانات', 'Open ads page', '::1', '2023-05-20 09:53:16', '2023-05-20 09:53:16'),
(50, '1', 'قام بفتح صفحة الإعلانات', 'Open ads page', '::1', '2023-05-20 09:53:29', '2023-05-20 09:53:29'),
(51, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:53:33', '2023-05-20 09:53:33'),
(52, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:54:24', '2023-05-20 09:54:24'),
(53, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:54:56', '2023-05-20 09:54:56'),
(54, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:55:34', '2023-05-20 09:55:34'),
(55, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:56:45', '2023-05-20 09:56:45'),
(56, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:57:23', '2023-05-20 09:57:23'),
(57, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:58:47', '2023-05-20 09:58:47'),
(58, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 09:59:20', '2023-05-20 09:59:20'),
(59, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-05-20 09:59:26', '2023-05-20 09:59:26'),
(60, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 09:59:26', '2023-05-20 09:59:26'),
(61, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 09:59:29', '2023-05-20 09:59:29'),
(62, '1', 'قام بحذف صفحة حالية الشروط والأحكام', 'Delete current page Terms & Conditions', '::1', '2023-05-20 10:00:27', '2023-05-20 10:00:27'),
(63, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 10:00:27', '2023-05-20 10:00:27'),
(64, '1', 'قام بإضافة صفحة جديدة erwer', 'Add new page ewr', '::1', '2023-05-20 10:00:36', '2023-05-20 10:00:36'),
(65, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 10:00:39', '2023-05-20 10:00:39'),
(66, '1', 'قام بحذف كل صفحات الموقع', 'Delete all website pages', '::1', '2023-05-20 10:00:44', '2023-05-20 10:00:44'),
(67, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-05-20 10:00:44', '2023-05-20 10:00:44'),
(68, '1', 'قام بفتح صفحة إتصل بنا', 'Open contact us page', '::1', '2023-05-20 10:00:48', '2023-05-20 10:00:48'),
(69, '1', 'قام بفتح صفحة إتصل بنا', 'Open contact us page', '::1', '2023-05-20 10:04:12', '2023-05-20 10:04:12'),
(70, '1', 'قام بفتح صفحة إتصل بنا', 'Open contact us page', '::1', '2023-05-20 10:06:15', '2023-05-20 10:06:15'),
(71, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:13:53', '2023-05-20 10:13:53'),
(72, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:14:27', '2023-05-20 10:14:27'),
(73, '1', 'قام بإضافة نوع مشزوع جديد مساجد', 'Add new project type Mosques', '::1', '2023-05-20 10:15:29', '2023-05-20 10:15:29'),
(74, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:15:31', '2023-05-20 10:15:31'),
(75, '1', 'قام بتعديل  نوع مشروع حالي مساجد', 'Edit current project type Mosques', '::1', '2023-05-20 10:16:23', '2023-05-20 10:16:23'),
(76, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:16:23', '2023-05-20 10:16:23'),
(77, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:17:00', '2023-05-20 10:17:00'),
(78, '1', 'قام بإضافة نوع مشزوع جديد أبار', 'Add new project type Wells', '::1', '2023-05-20 10:17:15', '2023-05-20 10:17:15'),
(79, '1', 'قام بإضافة نوع مشزوع جديد منازل', 'Add new project type Homes', '::1', '2023-05-20 10:17:24', '2023-05-20 10:17:24'),
(80, '1', 'قام بإضافة نوع مشزوع جديد مدارس', 'Add new project type Schools', '::1', '2023-05-20 10:17:32', '2023-05-20 10:17:32'),
(81, '1', 'قام بإضافة نوع مشزوع جديد دار أيتام', 'Add new project type Orphanages', '::1', '2023-05-20 10:17:54', '2023-05-20 10:17:54'),
(82, '1', 'قام بإضافة نوع مشزوع جديد مركز إسلامي', 'Add new project type Islamic centers', '::1', '2023-05-20 10:18:11', '2023-05-20 10:18:11'),
(83, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-05-20 10:18:13', '2023-05-20 10:18:13'),
(84, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 10:25:23', '2023-05-20 10:25:23'),
(85, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:53:59', '2023-05-20 10:53:59'),
(86, '1', 'قام بإضافة شركة جديدة الشركة المتحدة', 'Add new company United Comapny', '::1', '2023-05-20 10:57:19', '2023-05-20 10:57:19'),
(87, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:57:22', '2023-05-20 10:57:22'),
(88, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:57:57', '2023-05-20 10:57:57'),
(89, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:58:23', '2023-05-20 10:58:23'),
(90, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:58:39', '2023-05-20 10:58:39'),
(91, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 10:59:33', '2023-05-20 10:59:33'),
(92, '1', 'قام بتعديل الموافقة علي الملف  رخصة الشركة', 'Edit active of file of Company Licence', '::1', '2023-05-20 11:12:59', '2023-05-20 11:12:59'),
(93, '1', 'قام بتعديل شركة تاحية الشركة المتحدة', 'Edit current company United Company', '::1', '2023-05-20 11:13:23', '2023-05-20 11:13:23'),
(94, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 11:13:23', '2023-05-20 11:13:23'),
(95, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 11:13:38', '2023-05-20 11:13:38'),
(96, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 11:17:14', '2023-05-20 11:17:14'),
(97, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 11:17:18', '2023-05-20 11:17:18'),
(98, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-05-20 11:17:26', '2023-05-20 11:17:26'),
(99, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 11:17:26', '2023-05-20 11:17:26'),
(100, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 11:18:23', '2023-05-20 11:18:23'),
(101, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:33:26', '2023-05-20 11:33:26'),
(102, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:36:00', '2023-05-20 11:36:00'),
(103, '1', 'قام بإضافة عمل جيد مشروع ١', 'Add new portfolio Project 1', '::1', '2023-05-20 11:57:16', '2023-05-20 11:57:16'),
(104, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:57:19', '2023-05-20 11:57:19'),
(105, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:57:31', '2023-05-20 11:57:31'),
(106, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:57:55', '2023-05-20 11:57:55'),
(107, '1', 'قام بحذف عمل حاليمشروع ١', 'Delete current portfolio Project 1', '::1', '2023-05-20 11:58:02', '2023-05-20 11:58:02'),
(108, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 11:58:03', '2023-05-20 11:58:03'),
(109, '1', 'قام بتعديل عمل حاليمشروع ١', 'Edit current portfolio Project 1', '::1', '2023-05-20 12:01:10', '2023-05-20 12:01:10'),
(110, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 12:01:11', '2023-05-20 12:01:11'),
(111, '1', 'قام بتعديل عمل حاليمشروع ١', 'Edit current portfolio Project 1', '::1', '2023-05-20 12:04:20', '2023-05-20 12:04:20'),
(112, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 12:04:21', '2023-05-20 12:04:21'),
(113, '1', 'قام بتعديل عمل حاليمشروع ١', 'Edit current portfolio Project 1', '::1', '2023-05-20 12:05:22', '2023-05-20 12:05:22'),
(114, '1', 'قام بفتح صفحة أعمال الشركات', 'Open companies portfolio page', '::1', '2023-05-20 12:05:22', '2023-05-20 12:05:22'),
(115, '1', 'قام بفتح صفحة الشركات المنفذة', 'Open companies page', '::1', '2023-05-20 12:07:16', '2023-05-20 12:07:16'),
(116, '1', 'قام بتعديل تفعيل العمل : مشروع ١', 'Edit Activation of portfolio : Project 1', '::1', '2023-05-20 12:10:45', '2023-05-20 12:10:45'),
(117, '1', 'قام بتعديل تفعيل العمل : مشروع ١', 'Edit Activation of portfolio : Project 1', '::1', '2023-05-20 12:10:47', '2023-05-20 12:10:47'),
(118, '1', 'قام بفتح صفحة الأفكار', 'Open ideas page', '::1', '2023-05-20 12:20:24', '2023-05-20 12:20:24'),
(119, '1', 'قام بفتح صفحة الأفكار', 'Open ideas page', '::1', '2023-05-20 12:31:05', '2023-05-20 12:31:05'),
(120, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 12:32:39', '2023-05-20 12:32:39'),
(121, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-05-20 12:32:46', '2023-05-20 12:32:46'),
(122, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 12:32:46', '2023-05-20 12:32:46'),
(123, '1', 'قام بفتح صفحة الأفكار', 'Open ideas page', '::1', '2023-05-20 12:32:49', '2023-05-20 12:32:49'),
(124, '1', 'قام بفتح صفحة الأفكار', 'Open ideas page', '::1', '2023-05-20 12:33:25', '2023-05-20 12:33:25'),
(125, '1', 'قام بفتح صفحة الأفكار', 'Open ideas page', '::1', '2023-05-20 12:33:41', '2023-05-20 12:33:41'),
(126, '1', 'قام بفتح  الفكرة رقم 1', 'Open idea No. 1', '::1', '2023-05-20 12:33:43', '2023-05-20 12:33:43'),
(127, '1', 'قام بفتح  الفكرة رقم 1', 'Open idea No. 1', '::1', '2023-05-20 12:33:48', '2023-05-20 12:33:48'),
(128, '1', 'قام بفتح  الفكرة رقم 1', 'Open idea No. 1', '::1', '2023-05-20 12:35:24', '2023-05-20 12:35:24'),
(129, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-05-20 12:44:39', '2023-05-20 12:44:39'),
(130, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:05:15', '2023-05-20 13:05:15'),
(131, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:05:36', '2023-05-20 13:05:36'),
(132, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:06:11', '2023-05-20 13:06:11'),
(133, '1', 'قام بإضافة مشروع جديد مشروع ١', 'Add new project Project 1', '::1', '2023-05-20 13:16:19', '2023-05-20 13:16:19'),
(134, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:16:21', '2023-05-20 13:16:21'),
(135, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:16:48', '2023-05-20 13:16:48'),
(136, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-05-20 13:23:47', '2023-05-20 13:23:47'),
(137, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-05-20 13:23:47', '2023-05-20 13:23:47'),
(138, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:23:51', '2023-05-20 13:23:51'),
(139, '1', 'قام بعرض تبرعات المشروع  مشروع ١', 'show donation of project of Project 1', '::1', '2023-05-20 13:23:53', '2023-05-20 13:23:53'),
(140, '1', 'قام بتعديل مشروع حالي مشروع ١', 'Edit current project Project 1', '::1', '2023-05-20 13:24:39', '2023-05-20 13:24:39'),
(141, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:24:39', '2023-05-20 13:24:39'),
(142, '1', 'قام بعرض تبرعات المشروع  مشروع ١', 'show donation of project of Project 1', '::1', '2023-05-20 13:24:42', '2023-05-20 13:24:42'),
(143, '1', 'قام بتعديل الموافقة علي تقرير مشروع  تقرير ١', 'Edit active of project report of report 1', '::1', '2023-05-20 13:24:54', '2023-05-20 13:24:54'),
(144, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-05-20 13:29:28', '2023-05-20 13:29:28'),
(145, '1', 'قام بعرض تبرعات المشروع  مشروع ١', 'show donation of project of Project 1', '::1', '2023-05-20 13:29:30', '2023-05-20 13:29:30'),
(146, '6', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-05-20 16:09:59', '2023-05-20 16:09:59'),
(147, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '::1', '2023-05-20 16:10:00', '2023-05-20 16:10:00'),
(148, '6', 'قام بتعديل  بيانات حسابه', 'update his profile info', '::1', '2023-05-20 16:11:06', '2023-05-20 16:11:06'),
(149, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '::1', '2023-05-20 16:12:24', '2023-05-20 16:12:24'),
(150, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '::1', '2023-05-20 16:12:52', '2023-05-20 16:12:52'),
(151, '6', 'قام بإضافة عمل جيد مشروع ٢', 'Add new portfolio portfolio 2', '::1', '2023-05-20 16:14:44', '2023-05-20 16:14:44'),
(152, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '::1', '2023-05-20 16:14:46', '2023-05-20 16:14:46'),
(153, '6', 'قام بتعديل عمل حاليمشروع ٢', 'Edit current portfolio portfolio 2', '::1', '2023-05-20 16:14:54', '2023-05-20 16:14:54'),
(154, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '::1', '2023-05-20 16:14:54', '2023-05-20 16:14:54'),
(155, '6', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-05-20 16:15:51', '2023-05-20 16:15:51'),
(156, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '::1', '2023-05-20 16:15:51', '2023-05-20 16:15:51'),
(157, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '::1', '2023-05-20 16:15:54', '2023-05-20 16:15:54'),
(158, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '::1', '2023-05-20 16:20:04', '2023-05-20 16:20:04'),
(159, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '::1', '2023-05-20 16:20:36', '2023-05-20 16:20:36'),
(160, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '::1', '2023-05-20 16:25:11', '2023-05-20 16:25:11'),
(161, '6', 'قام برفع تقرير مشروع حالي مشروع ١', 'Upload report for current project Project 1', '::1', '2023-05-20 16:29:55', '2023-05-20 16:29:55'),
(162, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '::1', '2023-05-20 16:29:56', '2023-05-20 16:29:56'),
(163, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '::1', '2023-05-20 16:31:42', '2023-05-20 16:31:42'),
(164, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '::1', '2023-05-20 16:42:46', '2023-05-20 16:42:46'),
(165, '6', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from dashboard', '::1', '2023-05-20 16:42:49', '2023-05-20 16:42:49'),
(166, '6', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-05-20 16:42:56', '2023-05-20 16:42:56'),
(167, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '::1', '2023-05-20 16:42:57', '2023-05-20 16:42:57'),
(168, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-24 08:05:22', '2023-07-24 08:05:22'),
(169, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-24 08:05:23', '2023-07-24 08:05:23'),
(170, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-07-24 08:10:53', '2023-07-24 08:10:53'),
(171, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-24 08:19:38', '2023-07-24 08:19:38'),
(172, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-07-24 08:31:55', '2023-07-24 08:31:55'),
(173, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-24 08:31:55', '2023-07-24 08:31:55'),
(174, '1', 'قام بفتح صفحة التعريفات', 'Open tutorials page', '::1', '2023-07-24 09:00:19', '2023-07-24 09:00:19'),
(175, '1', 'قام بإضافة تعريف جديد غرس : بوابة المتبرعين والمتطوعين', 'Add new tutorial Ghars: Portal of donors and volunteers', '::1', '2023-07-24 09:36:22', '2023-07-24 09:36:22'),
(176, '1', 'قام بفتح صفحة التعريفات', 'Open tutorials page', '::1', '2023-07-24 09:42:21', '2023-07-24 09:42:21'),
(177, '1', 'قام بتعديل  تعريف حالي غرس : بوابة المتبرعين والمتطوعين', 'Edit current tutorial Ghars: Portal of donors and volunteers', '::1', '2023-07-24 09:42:49', '2023-07-24 09:42:49'),
(178, '1', 'قام بفتح صفحة التعريفات', 'Open tutorials page', '::1', '2023-07-24 09:42:49', '2023-07-24 09:42:49'),
(179, '1', 'قام بتعديل  تعريف حالي غرس : بوابة المتبرعين والمتطوعين', 'Edit current tutorial Ghars: Portal of donors and volunteers', '::1', '2023-07-24 09:43:31', '2023-07-24 09:43:31'),
(180, '1', 'قام بفتح صفحة التعريفات', 'Open tutorials page', '::1', '2023-07-24 09:43:31', '2023-07-24 09:43:31'),
(181, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-07-24 10:14:32', '2023-07-24 10:14:32'),
(182, '1', 'قام بعرض تبرعات المشروع  مشروع ١', 'show donation of project of Project 1', '::1', '2023-07-24 10:14:34', '2023-07-24 10:14:34'),
(183, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 10:34:47', '2023-07-24 10:34:47'),
(184, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 10:35:57', '2023-07-24 10:35:57'),
(185, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 10:37:55', '2023-07-24 10:37:55'),
(186, '1', 'قام بإضافة كفالة طفل يتيم جديدة علي محمد علي', 'Add new childern sponsorship Ali Mohamed Ali', '::1', '2023-07-24 11:10:12', '2023-07-24 11:10:12'),
(187, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 11:10:29', '2023-07-24 11:10:29'),
(188, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-07-24 11:10:34', '2023-07-24 11:10:34'),
(189, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 11:10:49', '2023-07-24 11:10:49'),
(190, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-07-24 11:17:36', '2023-07-24 11:17:36'),
(191, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-07-24 11:17:37', '2023-07-24 11:17:37'),
(192, '1', 'قام بتعديل كفالة طفل يتيم حالية علي محمد علي', 'Edit current child sponsorship Ali Mohamed Ali', '::1', '2023-07-24 11:19:27', '2023-07-24 11:19:27'),
(193, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 11:19:27', '2023-07-24 11:19:27'),
(194, '1', 'قام بتعديل تفعيل كفالة طفل : علي محمد علي', 'Edit Activation of child sponsorship : Ali Mohamed Ali', '::1', '2023-07-24 11:21:39', '2023-07-24 11:21:39'),
(195, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-07-24 11:21:41', '2023-07-24 11:21:41'),
(196, '1', 'قام بتعديل تفعيل كفالة طفل : علي محمد علي', 'Edit Activation of child sponsorship : Ali Mohamed Ali', '::1', '2023-07-24 11:21:45', '2023-07-24 11:21:45'),
(197, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-07-24 11:21:55', '2023-07-24 11:21:55'),
(198, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:24:39', '2023-07-24 12:24:39'),
(199, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:26:24', '2023-07-24 12:26:24'),
(200, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:26:40', '2023-07-24 12:26:40'),
(201, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:26:48', '2023-07-24 12:26:48'),
(202, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:27:00', '2023-07-24 12:27:00'),
(203, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:38:23', '2023-07-24 12:38:23'),
(204, '1', 'قام بعرض تبرعات كفالة أسرة  محمود أحمد محمد', 'show donation of family sponsorship of Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:38:29', '2023-07-24 12:38:29'),
(205, '1', 'قام بعرض تبرعات كفالة أسرة  محمود أحمد محمد', 'show donation of family sponsorship of Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:41:10', '2023-07-24 12:41:10'),
(206, '1', 'قام بتعديل كفالة أسرة حالية محمود أحمد محمد', 'Edit current family sponsorship Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:41:38', '2023-07-24 12:41:38'),
(207, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:41:38', '2023-07-24 12:41:38'),
(208, '1', 'قام بحذق تقرير كفالة أسرة  تقرير ٢', 'Delete family sponsorship report of Report 2', '::1', '2023-07-24 12:42:31', '2023-07-24 12:42:31'),
(209, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:42:35', '2023-07-24 12:42:35'),
(210, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 12:54:24', '2023-07-24 12:54:24'),
(211, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:54:30', '2023-07-24 12:54:30'),
(212, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:59:11', '2023-07-24 12:59:11'),
(213, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 12:59:17', '2023-07-24 12:59:17'),
(214, '1', 'قام بإضافة عضو جديد بأسرة محمد', 'Add new member at family Mohamed', '::1', '2023-07-24 13:08:29', '2023-07-24 13:08:29'),
(215, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:08:31', '2023-07-24 13:08:31'),
(216, '1', 'قام بتعديل عضو حالي بأسرة محمد', 'Edit current member at family Mohamed', '::1', '2023-07-24 13:14:51', '2023-07-24 13:14:51'),
(217, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:14:51', '2023-07-24 13:14:51'),
(218, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:17:16', '2023-07-24 13:17:16'),
(219, '1', 'قام بتعديل تفعيل عضو أسرة : محمد', 'Edit Activation of family member : Mohamed', '::1', '2023-07-24 13:17:20', '2023-07-24 13:17:20'),
(220, '1', 'قام بتعديل عضو حالي بأسرة محمد', 'Edit current member at family Mohamed', '::1', '2023-07-24 13:17:26', '2023-07-24 13:17:26'),
(221, '1', 'قام بعرض أفراد أسرة  محمود أحمد محمد', 'show members of family Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:17:26', '2023-07-24 13:17:26'),
(222, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-07-24 13:17:31', '2023-07-24 13:17:31'),
(223, '1', 'قام بتعديل تفعيل كفالة أسرة : محمود أحمد محمد', 'Edit Activation of family sponsorship : Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:17:32', '2023-07-24 13:17:32'),
(224, '1', 'قام بتعديل تفعيل كفالة أسرة : محمود أحمد محمد', 'Edit Activation of family sponsorship : Mahmoud Ahmed Mohammed', '::1', '2023-07-24 13:17:34', '2023-07-24 13:17:34'),
(225, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-25 04:01:17', '2023-07-25 04:01:17'),
(226, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-25 04:01:18', '2023-07-25 04:01:18'),
(227, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:41:08', '2023-07-25 04:41:08'),
(228, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:41:17', '2023-07-25 04:41:17'),
(229, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:47:15', '2023-07-25 04:47:15'),
(230, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:47:30', '2023-07-25 04:47:30'),
(231, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:47:47', '2023-07-25 04:47:47'),
(232, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 04:48:36', '2023-07-25 04:48:36'),
(233, '1', 'قام بإضافة كفالة داعية جديدة أحمد مراد', 'Add new teacher sponsorship Ahmed Morad', '::1', '2023-07-25 05:13:21', '2023-07-25 05:13:21'),
(234, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 05:13:24', '2023-07-25 05:13:24'),
(235, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-07-25 05:13:47', '2023-07-25 05:13:47'),
(236, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-07-25 05:13:57', '2023-07-25 05:13:57'),
(237, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-07-25 05:14:44', '2023-07-25 05:14:44'),
(238, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 05:16:54', '2023-07-25 05:16:54'),
(239, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-07-25 05:19:31', '2023-07-25 05:19:31'),
(240, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-07-25 05:19:32', '2023-07-25 05:19:32'),
(241, '1', 'قام بحذف تقرير كفالة داعية  تقرير ١', 'Delete teacher sponsorship report of Report 1', '::1', '2023-07-25 05:20:15', '2023-07-25 05:20:15'),
(242, '1', 'قام بتعديل كفالة داعية حالية أحمد مراد', 'Edit current teacher sponsorship Ahmed Morad', '::1', '2023-07-25 05:21:24', '2023-07-25 05:21:24'),
(243, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 05:21:25', '2023-07-25 05:21:25'),
(244, '1', 'قام بفتح صفحة أعضاء التطبيقات', 'Open application users page', '::1', '2023-07-25 05:21:35', '2023-07-25 05:21:35'),
(245, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-07-25 05:29:14', '2023-07-25 05:29:14'),
(246, '1', 'قام بعرض محاضرات الداعية  أحمد مراد', 'show lectures of teacher Ahmed Morad', '::1', '2023-07-25 05:29:18', '2023-07-25 05:29:18'),
(247, '1', 'قام بعرض محاضرات الداعية  أحمد مراد', 'show lectures of teacher Ahmed Morad', '::1', '2023-07-25 05:30:02', '2023-07-25 05:30:02'),
(248, '1', 'قام بإضافة محاضرة جديدة لداعية محاضرة ١', 'Add new lecture for teacher Lecture 1', '::1', '2023-07-25 05:32:52', '2023-07-25 05:32:52'),
(249, '1', 'قام بعرض محاضرات الداعية  أحمد مراد', 'show lectures of teacher Ahmed Morad', '::1', '2023-07-25 05:32:54', '2023-07-25 05:32:54'),
(250, '1', 'قام بتعديل تفعيل محاضرة داعية : محاضرة ١', 'Edit Activation of teacher lecture : Lecture 1', '::1', '2023-07-25 05:32:56', '2023-07-25 05:32:56'),
(251, '1', 'قام بتعديل تفعيل محاضرة داعية : محاضرة ١', 'Edit Activation of teacher lecture : Lecture 1', '::1', '2023-07-25 05:32:57', '2023-07-25 05:32:57'),
(252, '1', 'قام بتعديل محاضرة حالية لداعية محاضرة ١', 'Edit current video for teacher Lecture 1', '::1', '2023-07-25 05:34:09', '2023-07-25 05:34:09'),
(253, '1', 'قام بعرض محاضرات الداعية  أحمد مراد', 'show lectures of teacher Ahmed Morad', '::1', '2023-07-25 05:34:10', '2023-07-25 05:34:10'),
(254, '1', 'قام بعرض محاضرات الداعية  أحمد مراد', 'show lectures of teacher Ahmed Morad', '::1', '2023-07-25 05:34:20', '2023-07-25 05:34:20'),
(255, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:35:58', '2023-07-25 05:35:58'),
(256, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-07-25 05:36:35', '2023-07-25 05:36:35'),
(257, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:36:35', '2023-07-25 05:36:35'),
(258, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:38:20', '2023-07-25 05:38:20'),
(259, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:38:33', '2023-07-25 05:38:33'),
(260, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:38:38', '2023-07-25 05:38:38'),
(261, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:39:16', '2023-07-25 05:39:16'),
(262, '1', 'قام بفتح صفحة الزائرين', 'Open visitors page', '::1', '2023-07-25 05:40:49', '2023-07-25 05:40:49'),
(263, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:43:55', '2023-07-25 05:43:55'),
(264, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-07-25 05:44:03', '2023-07-25 05:44:03'),
(265, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-25 05:44:03', '2023-07-25 05:44:03'),
(266, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-07-25 06:02:59', '2023-07-25 06:02:59'),
(267, '1', 'قام بإضافة صورة جديدة بالإعلانات إعلان ١', 'Add new ads Ads 1', '::1', '2023-07-25 06:14:10', '2023-07-25 06:14:10'),
(268, '1', 'قام بفتح صفحة التعريفات', 'Open tutorials page', '::1', '2023-07-25 06:14:37', '2023-07-25 06:14:37'),
(269, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-25 09:59:54', '2023-07-25 09:59:54'),
(270, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-25 09:59:54', '2023-07-25 09:59:54'),
(271, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-25 10:00:04', '2023-07-25 10:00:04'),
(272, '1', 'قام بتعديل  صورة حالية بعارض الصور هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها', 'Edit current slider It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout', '::1', '2023-07-25 10:00:40', '2023-07-25 10:00:40'),
(273, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-25 10:00:41', '2023-07-25 10:00:41'),
(274, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-07-25 10:06:55', '2023-07-25 10:06:55'),
(275, '1', 'قام بتعديل  نوع مشروع حالي منازل', 'Edit current project type Homes', '::1', '2023-07-25 10:14:36', '2023-07-25 10:14:36'),
(276, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-07-25 10:14:36', '2023-07-25 10:14:36'),
(277, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-07-25 10:24:25', '2023-07-25 10:24:25'),
(278, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-07-25 10:25:02', '2023-07-25 10:25:02'),
(279, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-07-25 10:25:41', '2023-07-25 10:25:41'),
(280, '1', 'قام بتعديل إعدادات الموقع', 'Edit site settings ', '::1', '2023-07-25 10:25:52', '2023-07-25 10:25:52'),
(281, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-07-25 10:25:52', '2023-07-25 10:25:52'),
(282, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-26 10:33:15', '2023-07-26 10:33:15'),
(283, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-26 10:33:16', '2023-07-26 10:33:16'),
(284, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-07-26 10:34:18', '2023-07-26 10:34:18'),
(285, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-29 03:30:56', '2023-07-29 03:30:56'),
(286, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-29 03:30:56', '2023-07-29 03:30:56'),
(287, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-29 03:36:46', '2023-07-29 03:36:46'),
(288, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-07-29 03:36:56', '2023-07-29 03:36:56'),
(289, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-29 03:36:56', '2023-07-29 03:36:56'),
(290, '1', 'قام بفتح صفحة العملات', 'Open currencies page', '::1', '2023-07-29 03:38:13', '2023-07-29 03:38:13'),
(291, '1', 'قام بتعديل  عملة حالية ', 'Edit current currency ', '::1', '2023-07-29 03:39:12', '2023-07-29 03:39:12'),
(292, '1', 'قام بفتح صفحة العملات', 'Open currencies page', '::1', '2023-07-29 03:39:12', '2023-07-29 03:39:12'),
(293, '1', 'قام بفتح صفحة العملات', 'Open currencies page', '::1', '2023-07-29 03:39:45', '2023-07-29 03:39:45'),
(294, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-29 04:06:33', '2023-07-29 04:06:33'),
(295, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-29 04:16:43', '2023-07-29 04:16:43'),
(296, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-07-29 04:26:21', '2023-07-29 04:26:21'),
(297, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-07-29 04:26:22', '2023-07-29 04:26:22'),
(298, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:26:27', '2023-07-29 04:26:27'),
(299, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:26:41', '2023-07-29 04:26:41'),
(300, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:27:17', '2023-07-29 04:27:17'),
(301, '1', 'قام بإضافة هدية جديدة عيدية', 'Add new gift Eid Gift', '::1', '2023-07-29 04:27:46', '2023-07-29 04:27:46'),
(302, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:27:49', '2023-07-29 04:27:49'),
(303, '1', 'قام بتعديل  هدية حالية عيدية', 'Edit current gift Eid Gift', '::1', '2023-07-29 04:28:13', '2023-07-29 04:28:13'),
(304, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:28:13', '2023-07-29 04:28:13'),
(305, '1', 'قام بتعديل تفعيل الهدية : عيدية', 'Edit Activation of gift : Eid Gift', '::1', '2023-07-29 04:29:52', '2023-07-29 04:29:52'),
(306, '1', 'قام بتعديل تفعيل الهدية : عيدية', 'Edit Activation of gift : Eid Gift', '::1', '2023-07-29 04:29:53', '2023-07-29 04:29:53'),
(307, '1', 'قام بتعديل  هدية حالية عيدية', 'Edit current gift Eid Gift', '::1', '2023-07-29 04:30:03', '2023-07-29 04:30:03'),
(308, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:30:03', '2023-07-29 04:30:03'),
(309, '1', 'قام بتعديل  هدية حالية عيدية', 'Edit current gift Eid Gift', '::1', '2023-07-29 04:30:37', '2023-07-29 04:30:37'),
(310, '1', 'قام بفتح صفحة الهدايا', 'Open gifts page', '::1', '2023-07-29 04:30:37', '2023-07-29 04:30:37'),
(311, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-29 05:00:19', '2023-07-29 05:00:19'),
(312, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-30 09:03:13', '2023-07-30 09:03:13'),
(313, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-30 09:03:13', '2023-07-30 09:03:13'),
(314, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-30 09:03:19', '2023-07-30 09:03:19'),
(315, '1', 'قام بتعديل  صورة حالية بعارض الصور مشروع لبناء فصول دراسية في تنزانيا (المرحلة الثانية ) ...وذلك لتلقي العلم والفقه في الدين فبالعلم ترقى الأمم والمجتمعات وتقضي على الفقر وخاصةً علومُ الشريعةِ الإسلاميةِ السمحة والعلوم التطبيقة التي تفيد المجتمع.', 'Edit current slider A project to build classrooms in Tanzania (the second phase) ... in order to receive knowledge and jurisprudence in religion. With knowledge, nations and societies rise up and eradicate poverty, especially the sciences of tolerant Isla', '::1', '2023-07-30 09:05:30', '2023-07-30 09:05:30'),
(316, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-30 09:05:30', '2023-07-30 09:05:30'),
(317, '1', 'قام بتعديل  صورة حالية بعارض الصور مشروع لبناء فصول دراسية في تنزانيا (المرحلة الثانية ) ...وذلك لتلقي العلم والفقه في الدين فبالعلم ترقى الأمم والمجتمعات وتقضي على الفقر وخاصةً علومُ الشريعةِ الإسلاميةِ السمحة والعلوم التطبيقة التي تفيد المجتمع.', 'Edit current slider A project to build classrooms in Tanzania (the second phase) ... in order to receive knowledge and jurisprudence in religion. With knowledge, nations and societies rise up and eradicate poverty, especially the sciences of tolerant Isla', '::1', '2023-07-30 09:05:55', '2023-07-30 09:05:55'),
(318, '1', 'قام بفتح صفحة عارض الصور', 'Open slider page', '::1', '2023-07-30 09:05:55', '2023-07-30 09:05:55'),
(319, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-30 09:10:58', '2023-07-30 09:10:58'),
(320, '1', 'قام بتعديل  صفحة حالية نبذة عن غرس', 'Edit current page About Ghars', '::1', '2023-07-30 09:12:23', '2023-07-30 09:12:23'),
(321, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-30 09:12:24', '2023-07-30 09:12:24'),
(322, '1', 'قام بتعديل  صفحة حالية نبذة عن غرس', 'Edit current page About Ghars', '::1', '2023-07-30 09:13:15', '2023-07-30 09:13:15'),
(323, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-30 09:13:15', '2023-07-30 09:13:15'),
(324, '1', 'قام بتعديل  صفحة حالية إكتشف المزيد عن غرس', 'Edit current page Find out more about Ghars', '::1', '2023-07-30 09:25:44', '2023-07-30 09:25:44'),
(325, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-30 09:25:46', '2023-07-30 09:25:46'),
(326, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-07-31 10:07:47', '2023-07-31 10:07:47'),
(327, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-07-31 10:07:49', '2023-07-31 10:07:49'),
(328, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-07-31 10:07:52', '2023-07-31 10:07:52'),
(329, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-31 10:14:39', '2023-07-31 10:14:39'),
(330, '1', 'قام بتعديل  صفحة حالية إكتشف المزيد عن غرس ٢', 'Edit current page Find out more about Ghars 2', '::1', '2023-07-31 10:15:41', '2023-07-31 10:15:41'),
(331, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-31 10:15:42', '2023-07-31 10:15:42'),
(332, '1', 'قام بتعديل  صفحة حالية إكتشف المزيد عن غرس ٣', 'Edit current page Find out more about Ghars 3', '::1', '2023-07-31 10:17:03', '2023-07-31 10:17:03'),
(333, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-31 10:17:03', '2023-07-31 10:17:03'),
(334, '1', 'قام بتعديل  صفحة حالية إكتشف المزيد عن غرس ٣', 'Edit current page Find out more about Ghars 3', '::1', '2023-07-31 10:17:18', '2023-07-31 10:17:18'),
(335, '1', 'قام بفتح صفحة صفحات الموقع', 'Open website pages', '::1', '2023-07-31 10:17:19', '2023-07-31 10:17:19'),
(336, '1', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from admin dashboard', '::1', '2023-07-31 11:10:19', '2023-07-31 11:10:19'),
(337, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-08-02 08:22:44', '2023-08-02 08:22:44'),
(338, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-08-02 08:22:45', '2023-08-02 08:22:45'),
(339, '1', 'قام بفتح صفحة الدول', 'Open countries page', '::1', '2023-08-02 08:22:51', '2023-08-02 08:22:51'),
(340, '1', 'قام بتعديل  دولة حالية الكويت', 'Edit current country Kuwait', '::1', '2023-08-02 08:24:33', '2023-08-02 08:24:33'),
(341, '1', 'قام بفتح صفحة الدول', 'Open countries page', '::1', '2023-08-02 08:24:34', '2023-08-02 08:24:34'),
(342, '1', 'قام بفتح صفحة كفالات الإسر', 'Open families sponsorships page', '::1', '2023-08-02 11:46:01', '2023-08-02 11:46:01'),
(343, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-08-02 11:46:07', '2023-08-02 11:46:07'),
(344, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:51:57', '2023-08-02 11:51:57'),
(345, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:52:07', '2023-08-02 11:52:07'),
(346, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:52:28', '2023-08-02 11:52:28'),
(347, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:52:39', '2023-08-02 11:52:39'),
(348, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:52:53', '2023-08-02 11:52:53'),
(349, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:53:09', '2023-08-02 11:53:09'),
(350, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:53:16', '2023-08-02 11:53:16'),
(351, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:54:50', '2023-08-02 11:54:50'),
(352, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:56:21', '2023-08-02 11:56:21'),
(353, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:56:50', '2023-08-02 11:56:50'),
(354, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:57:06', '2023-08-02 11:57:06'),
(355, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:57:11', '2023-08-02 11:57:11'),
(356, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:57:13', '2023-08-02 11:57:13'),
(357, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 11:57:35', '2023-08-02 11:57:35'),
(358, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-08-02 12:03:25', '2023-08-02 12:03:25'),
(359, '1', 'قام بتعديل  مجموعة صلاحيات مشرفين حالية الإدراة العليا', 'Edit current supervisors powers group Top Management', '::1', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(360, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(361, '1', 'قام بفتح صفحة كفالات الأيتام', 'Open childern sponsorships page', '::1', '2023-08-02 12:03:50', '2023-08-02 12:03:50'),
(362, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:03:52', '2023-08-02 12:03:52'),
(363, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:11:48', '2023-08-02 12:11:48'),
(364, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:11:56', '2023-08-02 12:11:56'),
(365, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:12:04', '2023-08-02 12:12:04'),
(366, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:12:20', '2023-08-02 12:12:20'),
(367, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:12:26', '2023-08-02 12:12:26');
INSERT INTO `actions` (`id`, `user_id`, `ar_action`, `en_action`, `ip`, `created_at`, `updated_at`) VALUES
(368, '1', 'قام بعرض تبرعات كفالة طفل يتيم  علي محمد علي', 'show donation of child sponsorship of Ali Mohamed Ali', '::1', '2023-08-02 12:12:32', '2023-08-02 12:12:32'),
(369, '1', 'قام بفتح صفحة كفالات الدعاة', 'Open teachers sponsorships page', '::1', '2023-08-02 12:14:19', '2023-08-02 12:14:19'),
(370, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-08-02 12:14:22', '2023-08-02 12:14:22'),
(371, '1', 'قام بعرض تبرعات كفالة داعية  أحمد مراد', 'show donation of teacher sponsorship of Ahmed Morad', '::1', '2023-08-02 12:16:21', '2023-08-02 12:16:21'),
(372, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 12:16:29', '2023-08-02 12:16:29'),
(373, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 12:17:55', '2023-08-02 12:17:55'),
(374, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 12:18:20', '2023-08-02 12:18:20'),
(375, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 12:20:03', '2023-08-02 12:20:03'),
(376, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 12:20:18', '2023-08-02 12:20:18'),
(377, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-08-02 12:29:03', '2023-08-02 12:29:03'),
(378, '1', 'قام بتعديل إعدادات الموقع', 'Edit site settings ', '::1', '2023-08-02 12:34:31', '2023-08-02 12:34:31'),
(379, '1', 'قام بفتح صفحة إعدادات الموقع', 'Open site settings page', '::1', '2023-08-02 12:34:33', '2023-08-02 12:34:33'),
(380, '1', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '::1', '2023-08-02 16:57:24', '2023-08-02 16:57:24'),
(381, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-08-02 16:57:24', '2023-08-02 16:57:24'),
(382, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-08-02 16:57:32', '2023-08-02 16:57:32'),
(383, '1', 'قام بفتح صفحة صلاحيات المشرفين', 'Open supervisors powers page', '::1', '2023-08-02 16:58:21', '2023-08-02 16:58:21'),
(384, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-08-02 16:59:48', '2023-08-02 16:59:48'),
(385, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-08-02 16:59:55', '2023-08-02 16:59:55'),
(386, '1', 'قام بفتح صفحة أنواع المشاريع', 'Open projects types page', '::1', '2023-08-02 17:00:59', '2023-08-02 17:00:59'),
(387, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:05:04', '2023-08-02 17:05:04'),
(388, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:08:04', '2023-08-02 17:08:04'),
(389, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:08:51', '2023-08-02 17:08:51'),
(390, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:09:06', '2023-08-02 17:09:06'),
(391, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:09:42', '2023-08-02 17:09:42'),
(392, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:09:59', '2023-08-02 17:09:59'),
(393, '1', 'قام بإضافة مرحلة نوع مشروع جديدة مرحلة الأساس', 'Add new step for project type foundation stage', '::1', '2023-08-02 17:12:43', '2023-08-02 17:12:43'),
(394, '1', 'قام بإضافة مرحلة نوع مشروع جديدة مرحلة الإنشاء', 'Add new step for project type construction stage', '::1', '2023-08-02 17:13:06', '2023-08-02 17:13:06'),
(395, '1', 'قام بإضافة مرحلة نوع مشروع جديدة مرحلة التشطيب', 'Add new step for project type finishing stage', '::1', '2023-08-02 17:13:24', '2023-08-02 17:13:24'),
(396, '1', 'قام بإضافة مرحلة نوع مشروع جديدة مرحلة تجهيز المعدات', 'Add new step for project type equipment processing stage', '::1', '2023-08-02 17:13:44', '2023-08-02 17:13:44'),
(397, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:13:47', '2023-08-02 17:13:47'),
(398, '1', 'قام بتعديل  مرحلة نوع مشروع حالية مرحلة الأساس', 'Edit current step for project type foundation stage', '::1', '2023-08-02 17:16:00', '2023-08-02 17:16:00'),
(399, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:16:00', '2023-08-02 17:16:00'),
(400, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:17:20', '2023-08-02 17:17:20'),
(401, '1', 'قام بتعديل تفعيل مرحلة نوع مشروع : مرحلة الأساس', 'Edit Activation of project type step : foundation stage', '::1', '2023-08-02 17:17:28', '2023-08-02 17:17:28'),
(402, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:17:30', '2023-08-02 17:17:30'),
(403, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:17:36', '2023-08-02 17:17:36'),
(404, '1', 'قام بتعديل تفعيل مرحلة نوع مشروع : مرحلة الأساس', 'Edit Activation of project type step : foundation stage', '::1', '2023-08-02 17:17:40', '2023-08-02 17:17:40'),
(405, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:17:41', '2023-08-02 17:17:41'),
(406, '1', 'قام بحذف كل مراحل أنواع المشاريع', 'Delete all projects types steps', '::1', '2023-08-02 17:19:35', '2023-08-02 17:19:35'),
(407, '1', 'قام بعرض  مراحل نوع مشروع  دار أيتام', 'show steps for project type Orphanages', '::1', '2023-08-02 17:19:35', '2023-08-02 17:19:35'),
(408, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-08-02 17:25:17', '2023-08-02 17:25:17'),
(409, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-08-02 17:33:01', '2023-08-02 17:33:01'),
(410, '1', 'قام بتعديل مشروع حالي مشروع ١', 'Edit current project Project 1', '::1', '2023-08-02 17:40:07', '2023-08-02 17:40:07'),
(411, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-08-02 17:40:07', '2023-08-02 17:40:07'),
(412, '1', 'قام بتعديل مشروع حالي مشروع ١', 'Edit current project Project 1', '::1', '2023-08-02 17:41:24', '2023-08-02 17:41:24'),
(413, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-08-02 17:41:24', '2023-08-02 17:41:24'),
(414, '1', 'قام بفتح صفحة المشاريع', 'Open projects page', '::1', '2023-08-02 18:20:40', '2023-08-02 18:20:40'),
(415, '1', 'قام بعرض تبرعات المشروع  مشروع ١', 'show donation of project of Project 1', '::1', '2023-08-02 18:20:43', '2023-08-02 18:20:43'),
(416, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 18:21:04', '2023-08-02 18:21:04'),
(417, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '::1', '2023-08-02 18:23:38', '2023-08-02 18:23:38'),
(418, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 23:38:05', '2023-08-02 23:38:05'),
(419, '1', 'قام بفتح صفحة التبرعات', 'Open donations page', '::1', '2023-08-02 23:38:22', '2023-08-02 23:38:22'),
(420, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '141.101.98.10', '2023-08-05 19:42:19', '2023-08-05 19:42:19'),
(421, '1', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from admin dashboard', '141.101.99.92', '2023-08-05 19:42:28', '2023-08-05 19:42:28'),
(422, '6', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '141.101.99.91', '2023-08-05 19:42:44', '2023-08-05 19:42:44'),
(423, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '141.101.99.91', '2023-08-05 19:42:44', '2023-08-05 19:42:44'),
(424, '6', 'قام بفتح صفحة أعمال الشركة', 'Open company portfolio page', '141.101.99.91', '2023-08-05 19:42:49', '2023-08-05 19:42:49'),
(425, '6', 'قام بفتح صفحة مشاريع الشركة', 'Open company projects page', '141.101.99.91', '2023-08-05 19:43:02', '2023-08-05 19:43:02'),
(426, '6', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from dashboard', '141.101.99.92', '2023-08-05 19:43:12', '2023-08-05 19:43:12'),
(427, '1', 'قام بفتح الرئيسية للوحة التحكم', 'Go to admin dashboard homepage', '172.70.90.230', '2023-08-06 08:14:05', '2023-08-06 08:14:05'),
(428, '1', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from admin dashboard', '172.70.90.44', '2023-08-06 08:14:24', '2023-08-06 08:14:24'),
(429, '6', 'قام بتسجيل الدخول للوحة التحكم', 'Login to dashboard', '172.70.85.69', '2023-08-06 08:15:05', '2023-08-06 08:15:05'),
(430, '6', 'قام بفتح الرئيسية للوحة التحكم', 'Go to dashboard homepage', '172.70.85.69', '2023-08-06 08:15:06', '2023-08-06 08:15:06'),
(431, '6', 'قام بتسجيل الخرج من لوحة التحكم', 'Logout from dashboard', '172.70.85.68', '2023-08-06 08:15:13', '2023-08-06 08:15:13');

-- --------------------------------------------------------

--
-- Table structure for table `ads`
--

CREATE TABLE `ads` (
  `id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `type` enum('web','app') NOT NULL,
  `link` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `ads`
--

INSERT INTO `ads` (`id`, `ar_name`, `en_name`, `image`, `active`, `type`, `link`, `created_at`, `updated_at`) VALUES
(1, 'اعلان ١', 'Ads 1', 'yxl9H.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yes', 'web', 'https://www.google.com/', '2023-05-20 09:46:13', '2023-05-20 09:47:02'),
(2, 'إعلان ١', 'Ads 1', 'tK5AS.larm-rmah-AEaTUnvneik-unsplash 1.png', 'yes', 'app', 'https://www.google.com/', '2023-07-25 06:14:10', '2023-07-25 06:14:10');

-- --------------------------------------------------------

--
-- Table structure for table `api_key`
--

CREATE TABLE `api_key` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `lang` varchar(255) NOT NULL,
  `platform` varchar(255) NOT NULL,
  `key` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `api_key`
--

INSERT INTO `api_key` (`id`, `user_id`, `lang`, `platform`, `key`, `created_at`, `updated_at`) VALUES
(1, 1, 'en', 'ios', 'dfsdfsdfsdfsdasdsadsfdsfdsfdf', '2023-07-25 06:11:51', '2023-07-29 04:07:42'),
(2, 0, 'en', 'ios', 'dsdasdsadasdasdasdasdasdasdsad', '2023-07-25 06:27:51', '2023-07-25 10:01:29'),
(3, 0, 'en', 'android', 'cSS9mhuRSHSeGuP12N4aK-:APA91bGk9SRaI6OLk3d5TnJpN2ZfuDXXU1wkw2Gw-sMqPbbQutrd4PfqivI3iLjUF06WiFFww-gkqgL163vaGmpKzF6eoxkyNVUgG3iXJ15HrpLpAoDa3hm2Lp5tt6NDUnMjDXFGsB_r', '2023-08-03 08:53:23', '2023-08-03 08:53:23'),
(4, 0, 'ar', 'android', 'BLACKLISTED', '2023-08-03 16:15:05', '2023-08-03 16:15:33');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `ar_name`, `en_name`, `active`, `image`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'مساجد', 'Mosques', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:15:29', '2023-07-25 10:14:45', NULL),
(2, 'أبار', 'Wells', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:17:15', '2023-07-25 10:14:46', NULL),
(3, 'منازل', 'Homes', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:17:24', '2023-07-25 10:14:36', NULL),
(4, 'مدارس', 'Schools', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:17:32', '2023-07-25 10:14:48', NULL),
(5, 'دار أيتام', 'Orphanages', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:17:54', '2023-07-25 10:14:49', NULL),
(6, 'مركز إسلامي', 'Islamic centers', 'yes', 'erMpM.Rectangle 1526.png', '2023-05-20 10:18:11', '2023-07-25 10:14:50', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `categories_steps`
--

CREATE TABLE `categories_steps` (
  `id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `sort` int(11) NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `categories_steps`
--

INSERT INTO `categories_steps` (`id`, `category_id`, `ar_name`, `en_name`, `sort`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 5, 'مرحلة الأساس', 'foundation stage', 1, 'yes', '2023-08-02 17:12:43', '2023-08-02 17:17:40', NULL),
(2, 5, 'مرحلة الإنشاء', 'construction stage', 2, 'yes', '2023-08-02 17:13:06', '2023-08-02 17:13:06', NULL),
(3, 5, 'مرحلة التشطيب', 'finishing stage', 3, 'yes', '2023-08-02 17:13:24', '2023-08-02 17:13:24', NULL),
(4, 5, 'مرحلة تجهيز المعدات', 'equipment processing stage', 4, 'yes', '2023-08-02 17:13:44', '2023-08-02 17:19:51', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `childern`
--

CREATE TABLE `childern` (
  `id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `gender` enum('male','female') NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `birth_date` varchar(255) NOT NULL,
  `birth_no` varchar(255) NOT NULL,
  `ar_nationality` varchar(255) NOT NULL,
  `en_nationality` varchar(255) NOT NULL,
  `ar_governate` varchar(255) NOT NULL,
  `en_governate` varchar(255) NOT NULL,
  `ar_city` varchar(255) NOT NULL,
  `en_city` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `ar_study_stage` varchar(255) NOT NULL,
  `en_study_stage` varchar(255) NOT NULL,
  `ar_class` varchar(255) NOT NULL,
  `en_class` varchar(255) NOT NULL,
  `study_report` varchar(255) NOT NULL,
  `ar_quran` varchar(255) NOT NULL,
  `en_quran` varchar(255) NOT NULL,
  `ar_skills` text NOT NULL,
  `en_skills` text NOT NULL,
  `ar_psychological` varchar(255) NOT NULL,
  `en_psychological` varchar(255) NOT NULL,
  `ar_illness` varchar(255) NOT NULL,
  `en_illness` varchar(255) NOT NULL,
  `ar_healthy` varchar(255) NOT NULL,
  `en_healthy` varchar(255) NOT NULL,
  `ar_illness_desc` text NOT NULL,
  `en_illness_desc` text NOT NULL,
  `death_date` varchar(255) NOT NULL,
  `ar_death_reason` varchar(255) NOT NULL,
  `en_death_reason` varchar(255) NOT NULL,
  `ar_responsible` varchar(255) NOT NULL,
  `en_responsible` varchar(255) NOT NULL,
  `ar_relative` varchar(255) NOT NULL,
  `en_relative` varchar(255) NOT NULL,
  `brothers` int(11) NOT NULL,
  `sisters` int(11) NOT NULL,
  `amount` varchar(255) NOT NULL,
  `required` enum('no','yes') NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `childern`
--

INSERT INTO `childern` (`id`, `country_id`, `gender`, `ar_name`, `en_name`, `birth_date`, `birth_no`, `ar_nationality`, `en_nationality`, `ar_governate`, `en_governate`, `ar_city`, `en_city`, `image`, `ar_study_stage`, `en_study_stage`, `ar_class`, `en_class`, `study_report`, `ar_quran`, `en_quran`, `ar_skills`, `en_skills`, `ar_psychological`, `en_psychological`, `ar_illness`, `en_illness`, `ar_healthy`, `en_healthy`, `ar_illness_desc`, `en_illness_desc`, `death_date`, `ar_death_reason`, `en_death_reason`, `ar_responsible`, `en_responsible`, `ar_relative`, `en_relative`, `brothers`, `sisters`, `amount`, `required`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 63, 'male', 'علي محمد علي', 'Ali Mohamed Ali', '2009-11-04', '12323', 'مصري', 'Egptian', 'القاهرة', 'Cairo', 'إمبابة', 'Embaba', 'N4T7O.image 16.png', 'إبتدائي', 'primary', 'الصف الرابع', 'Fourth Class', 'knvHP.image 16.png', 'جزئين', 'two chapters', 'كرة القدم', 'Football', 'جيد', 'Good', 'لا يوجد', 'none', 'ضعيف', 'Weak', 'لا توجد امراض', 'No Illness', '2019-06-14', 'حادث', 'Accident', 'محمود علي أحمد', 'Mahmoud Ali Ahmed', 'العم', 'Uncle', 2, 1, '30', 'yes', 'yes', '2023-07-24 11:10:12', '2023-07-24 11:21:45', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `childern_donations`
--

CREATE TABLE `childern_donations` (
  `id` int(11) NOT NULL,
  `child_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `active` enum('unpaid','yes','yet','no') NOT NULL,
  `day` int(11) NOT NULL,
  `user_type` enum('user','visitor') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `childern_reports`
--

CREATE TABLE `childern_reports` (
  `id` int(11) NOT NULL,
  `child_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `childern_reports`
--

INSERT INTO `childern_reports` (`id`, `child_id`, `ar_name`, `en_name`, `file`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'تقرير ١', 'Report 1', 'EKcY4.image 16.png', 'yes', '2023-07-24 11:10:12', '2023-07-24 11:10:12');

-- --------------------------------------------------------

--
-- Table structure for table `contacts`
--

CREATE TABLE `contacts` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `reply` text NOT NULL,
  `seen` enum('no','yes') NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `contacts`
--

INSERT INTO `contacts` (`id`, `name`, `phone`, `email`, `title`, `message`, `reply`, `seen`, `created_at`, `updated_at`) VALUES
(1, 'asd', '4234234', 'dasd@das.das', '', 'sad asd asd', '', 'no', '2023-07-31 11:58:58', '2023-07-31 11:58:58');

-- --------------------------------------------------------

--
-- Table structure for table `countries`
--

CREATE TABLE `countries` (
  `id` int(11) NOT NULL,
  `currency_id` int(11) NOT NULL,
  `iso` char(2) DEFAULT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(80) NOT NULL,
  `iso3` char(3) DEFAULT NULL,
  `numcode` smallint(6) DEFAULT NULL,
  `code` varchar(5) NOT NULL,
  `ar_address` text NOT NULL,
  `en_address` text NOT NULL,
  `delegate_1` varchar(255) NOT NULL,
  `delegate_2` varchar(255) NOT NULL,
  `headquarter_1` varchar(255) NOT NULL,
  `headquarter_2` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `countries`
--

INSERT INTO `countries` (`id`, `currency_id`, `iso`, `ar_name`, `en_name`, `iso3`, `numcode`, `code`, `ar_address`, `en_address`, `delegate_1`, `delegate_2`, `headquarter_1`, `headquarter_2`, `active`, `created_at`, `updated_at`) VALUES
(1, 7, 'AF', 'أفغانستان', 'Afghanistan', 'AFG', 4, '+93', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2023-03-28 17:46:42'),
(2, 7, 'AL', 'ألبانيا', 'Albania', 'ALB', 8, '+355', '٥-٧ أيام', '5-7 days', '', '', '', '', 'no', '2021-06-14 00:03:32', '2021-08-10 07:49:53'),
(3, 7, 'DZ', 'الجزائر', 'Algeria', 'DZA', 12, '+213', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(4, 7, 'AS', 'ساموا الأمريكية', 'American Samoa', 'ASM', 16, '+1684', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(5, 7, 'AD', 'أندورا', 'Andorra', 'AND', 20, '+376', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(6, 7, 'AO', 'أنغولا', 'Angola', 'AGO', 24, '+244', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(7, 7, 'AI', 'أنغيلا', 'Anguilla', 'AIA', 660, '+1264', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(8, 7, 'AQ', 'أنتاركتيكا', 'Antarctica', NULL, NULL, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(9, 7, 'AG', 'أنتيغوا وبربودا', 'Antigua And Barbuda', 'ATG', 28, '+1268', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(10, 7, 'AR', 'الأرجنتين', 'Argentina', 'ARG', 32, '+54', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(11, 7, 'AM', 'أرمينيا', 'Armenia', 'ARM', 51, '+374', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(12, 7, 'AW', 'أروبا', 'Aruba', 'ABW', 533, '+297', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(13, 7, 'AU', 'أستراليا', 'Australia', 'AUS', 36, '+61', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(14, 7, 'AT', 'النمسا', 'Austria', 'AUT', 40, '+43', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(15, 7, 'AZ', 'أذربيجان', 'Azerbaijan', 'AZE', 31, '+994', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(16, 7, 'BS', 'الباهاما', 'Bahamas', 'BHS', 44, '+1242', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(17, 2, 'BH', 'البحرين', 'Bahrain', 'BHR', 48, '+973', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 01:16:17'),
(18, 7, 'BD', 'بنجلادش', 'Bangladesh', 'BGD', 50, '+880', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(19, 7, 'BB', 'بربادوس', 'Barbados', 'BRB', 52, '+1246', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(20, 7, 'BY', 'بيلاروسيا', 'Belarus', 'BLR', 112, '+375', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(21, 7, 'BE', 'بلجيكا', 'Belgium', 'BEL', 56, '+32', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(22, 7, 'BZ', 'بليز', 'Belize', 'BLZ', 84, '+501', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(23, 7, 'BJ', 'بنين', 'Benin', 'BEN', 204, '+229', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(24, 7, 'BM', 'برمودا', 'Bermuda', 'BMU', 60, '+1441', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(25, 7, 'BT', 'بوتان', 'Bhutan', 'BTN', 64, '+975', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(26, 7, 'BO', 'بوليفيا', 'Bolivia', 'BOL', 68, '+591', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(27, 7, 'BA', 'البوسنة والهرسك', 'Bosnia And Herzegovina', 'BIH', 70, '+387', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(28, 7, 'BW', 'بتسوانا', 'Botswana', 'BWA', 72, '+267', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(29, 7, 'BV', 'جزيرة بوفيت', 'Bouvet Island', NULL, NULL, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(30, 7, 'BR', 'البرازيل', 'Brazil', 'BRA', 76, '+55', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(31, 7, 'IO', 'إقليم المحيط البريطاني الهندي', 'British Indian Ocean Territory', NULL, NULL, '+246', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(32, 7, 'BN', 'بروناي دار السلام', 'Brunei Darussalam', 'BRN', 96, '+673', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(33, 7, 'BG', 'بلغاريا', 'Bulgaria', 'BGR', 100, '+359', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(34, 7, 'BF', 'بوركينا فاسو', 'Burkina Faso', 'BFA', 854, '+226', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(35, 7, 'BI', 'بوروندي', 'Burundi', 'BDI', 108, '+257', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(36, 7, 'KH', 'كمبوديا', 'Cambodia', 'KHM', 116, '+855', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(37, 7, 'CM', 'الكاميرون', 'Cameroon', 'CMR', 120, '+237', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(38, 7, 'CA', 'كندا', 'Canada', 'CAN', 124, '+1', '٥-٧ أيام', '5-7 days', '', '', '', '', 'no', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(39, 7, 'CV', 'كاب فيردي', 'Cape Verde', 'CPV', 132, '+238', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(40, 7, 'KY', 'جزر كايمان', 'Cayman Islands', 'CYM', 136, '+1345', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(41, 7, 'CF', 'جمهورية افريقيا الوسطى', 'Central African Republic', 'CAF', 140, '+236', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(42, 7, 'TD', 'تشاد', 'Chad', 'TCD', 148, '+235', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(43, 7, 'CL', 'تشيلي', 'Chile', 'CHL', 152, '+56', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(44, 7, 'CN', 'الصين', 'China', 'CHN', 156, '+86', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(45, 7, 'CX', 'جزيرة الكريسماس', 'Christmas Island', NULL, NULL, '+61', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(46, 7, 'CC', 'جزر كوكوس (كيلينغ)', 'Cocos (keeling) Islands', NULL, NULL, '+672', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(47, 7, 'CO', 'كولومبيا', 'Colombia', 'COL', 170, '+57', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(48, 7, 'KM', '', 'Comoros', 'COM', 174, '+269', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(49, 7, 'CG', 'الكونغو', 'Congo', 'COG', 178, '+242', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(50, 7, 'CD', 'جمهورية الكونغو الديمقراطية', 'Congo, The Democratic Republic Of The', 'COD', 180, '+242', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(51, 7, 'CK', 'جزر كوك', 'Cook Islands', 'COK', 184, '+682', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(52, 7, 'CR', 'كوستا ريكا', 'Costa Rica', 'CRI', 188, '+506', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(53, 7, 'CI', 'كوت ديفوار', 'Cote D\'ivoire', 'CIV', 384, '+225', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(54, 7, 'HR', 'كرواتيا', 'Croatia', 'HRV', 191, '+385', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(55, 7, 'CU', 'كوبا', 'Cuba', 'CUB', 192, '+53', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(56, 7, 'CY', 'قبرص', 'Cyprus', 'CYP', 196, '+357', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(57, 7, 'CZ', 'جمهورية التشيك', 'Czech Republic', 'CZE', 203, '+420', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(58, 7, 'DK', 'الدنمارك', 'Denmark', 'DNK', 208, '+45', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(59, 7, 'DJ', 'جيبوتي', 'Djibouti', 'DJI', 262, '+253', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(60, 7, 'DM', 'دومينيكا', 'Dominica', 'DMA', 212, '+1767', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(61, 7, 'DO', 'جمهورية الدومينيكان', 'Dominican Republic', 'DOM', 214, '+1809', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(62, 7, 'EC', 'الاكوادور', 'Ecuador', 'ECU', 218, '+593', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(63, 7, 'EG', 'مصر', 'Egypt', 'EGY', 818, '+20', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(64, 7, 'SV', 'السلفادور', 'El Salvador', 'SLV', 222, '+503', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(65, 7, 'GQ', 'غينيا الإستوائية', 'Equatorial Guinea', 'GNQ', 226, '+240', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(66, 7, 'ER', 'إريتريا', 'Eritrea', 'ERI', 232, '+291', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(67, 7, 'EE', 'إستونيا', 'Estonia', 'EST', 233, '+372', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(68, 7, 'ET', 'أثيوبيا', 'Ethiopia', 'ETH', 231, '+251', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(69, 7, 'FK', 'جزر فوكلاند (مالفيناس)', 'Falkland Islands (malvinas)', 'FLK', 238, '+500', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(70, 7, 'FO', 'جزر فاروس', 'Faroe Islands', 'FRO', 234, '+298', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(71, 7, 'FJ', 'فيجي', 'Fiji', 'FJI', 242, '+679', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(72, 7, 'FI', 'فنلندا', 'Finland', 'FIN', 246, '+358', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(73, 7, 'FR', 'فرنسا', 'France', 'FRA', 250, '+33', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(74, 7, 'GF', 'غيانا الفرنسية', 'French Guiana', 'GUF', 254, '+594', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(75, 7, 'PF', 'بولينيزيا الفرنسية', 'French Polynesia', 'PYF', 258, '+689', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(76, 7, 'TF', 'المناطق الجنوبية لفرنسا', 'French Southern Territories', NULL, NULL, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(77, 7, 'GA', 'جابون', 'Gabon', 'GAB', 266, '+241', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(78, 7, 'GM', 'جامبيا', 'Gambia', 'GMB', 270, '+220', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(79, 7, 'GE', 'جورجيا', 'Georgia', 'GEO', 268, '+995', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(80, 7, 'DE', 'ألمانيا', 'Germany', 'DEU', 276, '+49', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(81, 7, 'GH', 'غانا', 'Ghana', 'GHA', 288, '+233', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(82, 7, 'GI', 'جبل طارق', 'Gibraltar', 'GIB', 292, '+350', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(83, 7, 'GR', 'اليونان', 'Greece', 'GRC', 300, '+30', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(84, 7, 'GL', 'جرين لاند', 'Greenland', 'GRL', 304, '+299', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(85, 7, 'GD', 'غرينادا', 'Grenada', 'GRD', 308, '+1473', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(86, 7, 'GP', 'جوادلوب', 'Guadeloupe', 'GLP', 312, '+590', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(87, 7, 'GU', 'جوام', 'Guam', 'GUM', 316, '+1671', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(88, 7, 'GT', 'جواتيمالا', 'Guatemala', 'GTM', 320, '+502', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(89, 7, 'GN', 'غينيا', 'Guinea', 'GIN', 324, '+224', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(90, 7, 'GW', 'غينيا بيساو', 'Guinea-bissau', 'GNB', 624, '+245', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(91, 7, 'GY', 'غيانا', 'Guyana', 'GUY', 328, '+592', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(92, 7, 'HT', 'هايتي', 'Haiti', 'HTI', 332, '+509', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(93, 7, 'HM', 'قلب الجزيرة وجزر ماكدونالز', 'Heard Island And Mcdonald Islands', NULL, NULL, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(94, 7, 'VA', 'الكرسي الرسولي (دولة مدينة الفاتيكان)', 'Holy See (vatican City State)', 'VAT', 336, '+39', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(95, 7, 'HN', 'هندوراس', 'Honduras', 'HND', 340, '+504', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(96, 7, 'HK', 'هونج كونج', 'Hong Kong', 'HKG', 344, '+852', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(97, 7, 'HU', 'المجر', 'Hungary', 'HUN', 348, '+36', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(98, 7, 'IS', 'آيسلاند', 'Iceland', 'ISL', 352, '+354', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(99, 7, 'IN', 'الهند', 'India', 'IND', 356, '+91', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(100, 7, 'ID', 'إندونيسيا', 'Indonesia', 'IDN', 360, '+62', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(101, 7, 'IR', 'إيران', 'Iran', 'IRN', 364, '+98', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(102, 7, 'IQ', 'العراق', 'Iraq', 'IRQ', 368, '+964', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(103, 7, 'IE', 'إيرلندا', 'Ireland', 'IRL', 372, '+353', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(104, 7, 'IL', 'إسرائيل', 'Israel', 'ISR', 376, '+972', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(105, 7, 'IT', 'إيطاليا', 'Italy', 'ITA', 380, '+39', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(106, 7, 'JM', 'جامايكا', 'Jamaica', 'JAM', 388, '+1876', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(107, 7, 'JP', 'اليابان', 'Japan', 'JPN', 392, '+81', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(108, 7, 'JO', 'الأودن', 'Jordan', 'JOR', 400, '+962', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(109, 7, 'KZ', 'كازاخستان', 'Kazakhstan', 'KAZ', 398, '+7', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(110, 7, 'KE', 'كينيا', 'Kenya', 'KEN', 404, '+254', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(111, 7, 'KI', 'كيريباتي', 'Kiribati', 'KIR', 296, '+686', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(112, 7, 'KP', 'جمهورية كوريا الديمقراطية االشعبية', 'Democratic People\'s Republic Of Korea', 'PRK', 408, '+850', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(113, 7, 'KR', 'جمهورية كوريا', 'Republic Of Korea', 'KOR', 410, '+82', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(114, 1, 'KW', 'الكويت', 'Kuwait', 'KWT', 414, '+965', 'الفردوس قطعة 11 شارع 5 رقم المنزل 4', 'Al-Firdous, Block 11, Street 5, House No. 4', '50733443', '50733444', '50733441', '50733442', 'yes', '2021-06-14 00:03:32', '2023-08-02 08:24:33'),
(115, 7, 'KG', 'قيرغيزستان', 'Kyrgyzstan', 'KGZ', 417, '+996', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(116, 7, 'LA', 'لاو ', 'Lao', 'LAO', 418, '+856', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(117, 7, 'LV', 'لاتفيا', 'Latvia', 'LVA', 428, '+371', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(118, 7, 'LB', 'لبنان', 'Lebanon', 'LBN', 422, '+961', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(119, 7, 'LS', 'ليسوتو', 'Lesotho', 'LSO', 426, '+266', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(120, 7, 'LR', 'ليبيريا', 'Liberia', 'LBR', 430, '+231', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(121, 7, 'LY', 'ليبيا', 'Libya', 'LBY', 434, '+218', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(122, 7, 'LI', 'ليختنشتاين', 'Liechtenstein', 'LIE', 438, '+423', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(123, 7, 'LT', 'ليثوانيا', 'Lithuania', 'LTU', 440, '+370', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(124, 7, 'LU', 'لوكسمبورغ', 'Luxembourg', 'LUX', 442, '+352', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(125, 7, 'MO', 'ماكاو', 'Macao', 'MAC', 446, '+853', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(126, 7, 'MK', 'مقدونيا', 'Macedonia', 'MKD', 807, '+389', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(127, 7, 'MG', 'مدغشقر', 'Madagascar', 'MDG', 450, '+261', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(128, 7, 'MW', 'ملاوي', 'Malawi', 'MWI', 454, '+265', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(129, 7, 'MY', 'ماليزيا', 'Malaysia', 'MYS', 458, '+60', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(130, 7, 'MV', 'جزر المالديف', 'Maldives', 'MDV', 462, '+960', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(131, 7, 'ML', 'مالي', 'Mali', 'MLI', 466, '+223', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(132, 7, 'MT', 'مالطا', 'Malta', 'MLT', 470, '+356', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(133, 7, 'MH', 'جزر مارشال', 'Marshall Islands', 'MHL', 584, '+692', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(134, 7, 'MQ', 'مارتينيك', 'Martinique', 'MTQ', 474, '+596', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(135, 7, 'MR', 'موريتانيا', 'Mauritania', 'MRT', 478, '+222', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(136, 7, 'MU', 'موريشيوس', 'Mauritius', 'MUS', 480, '+230', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(137, 7, 'YT', 'مايوت', 'Mayotte', NULL, NULL, '+269', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(138, 7, 'MX', 'المكسيك', 'Mexico', 'MEX', 484, '+52', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(139, 7, 'FM', 'ولايات ميكرونيزيا الموحدة', 'Federated States Of Micronesia', 'FSM', 583, '+691', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(140, 7, 'MD', 'جمهورية مولدوفا', 'Republic Of Moldova', 'MDA', 498, '+373', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(141, 7, 'MC', 'موناكو', 'Monaco', 'MCO', 492, '+377', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(142, 7, 'MN', 'منغوليا', 'Mongolia', 'MNG', 496, '+976', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(143, 7, 'MS', 'مونتسيرات', 'Montserrat', 'MSR', 500, '+1664', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(144, 7, 'MA', 'المغرب', 'Morocco', 'MAR', 504, '+212', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(145, 7, 'MZ', 'موزامبيق', 'Mozambique', 'MOZ', 508, '+258', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(146, 7, 'MM', 'ميانمار', 'Myanmar', 'MMR', 104, '+95', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(147, 7, 'NA', 'ناميبيا', 'Namibia', 'NAM', 516, '+264', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(148, 7, 'NR', 'ناورو', 'Nauru', 'NRU', 520, '+674', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(149, 7, 'NP', 'نيبال', 'Nepal', 'NPL', 524, '+977', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(150, 7, 'NL', 'هولندا', 'Netherlands', 'NLD', 528, '+31', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(151, 7, 'AN', 'جزر الأنتيل الهولندية', 'Netherlands Antilles', 'ANT', 530, '+599', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(152, 7, 'NC', 'كاليدونيا الجديدة', 'New Caledonia', 'NCL', 540, '+687', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(153, 7, 'NZ', 'نيوزيلاندا', 'New Zealand', 'NZL', 554, '+64', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(154, 7, 'NI', 'نيكاراغوا', 'Nicaragua', 'NIC', 558, '+505', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(155, 7, 'NE', 'النيجر', 'Niger', 'NER', 562, '+227', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(156, 7, 'NG', 'نيجيريا', 'Nigeria', 'NGA', 566, '+234', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(157, 7, 'NU', 'نيوي', 'Niue', 'NIU', 570, '+683', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(158, 7, 'NF', 'جزيرة نورفولك', 'Norfolk Island', 'NFK', 574, '+672', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(159, 7, 'MP', 'جزر مريانا الشمالية', 'Northern Mariana Islands', 'MNP', 580, '+1670', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(160, 7, 'NO', 'النرويج', 'Norway', 'NOR', 578, '+47', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(161, 6, 'OM', 'عمان', 'Oman', 'OMN', 512, '+968', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 01:17:29'),
(162, 7, 'PK', 'باكستان', 'Pakistan', 'PAK', 586, '+92', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(163, 7, 'PW', 'بالاو', 'Palau', 'PLW', 585, '+680', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(164, 7, 'PS', 'فلسطين', 'Palestin', NULL, NULL, '+970', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(165, 7, 'PA', 'بنما', 'Panama', 'PAN', 591, '+507', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(166, 7, 'PG', 'بابوا غينيا الجديدة', 'Papua New Guinea', 'PNG', 598, '+675', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(167, 7, 'PY', 'باراغواي', 'Paraguay', 'PRY', 600, '+595', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(168, 7, 'PE', 'بيرو', 'Peru', 'PER', 604, '+51', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(169, 7, 'PH', 'الفلبين', 'Philippine', 'PHL', 608, '+63', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(170, 7, 'PN', 'بيتكيرن', 'Pitcairn', 'PCN', 612, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(171, 7, 'PL', 'بولندا', 'Poland', 'POL', 616, '+48', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(172, 7, 'PT', 'البرتغال', 'Portugal', 'PRT', 620, '+351', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(173, 7, 'PR', 'بويرتو ريكو', 'Puerto Rico', 'PRI', 630, '+1787', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(174, 5, 'QA', 'قطر', 'Qatar', 'QAT', 634, '+974', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 01:17:11'),
(175, 7, 'RE', 'ريونيون', 'Reunion', 'REU', 638, '+262', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(176, 7, 'RO', 'رومانيا', 'Romania', 'ROM', 642, '+40', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(177, 7, 'RU', 'روسيا', 'Russia', 'RUS', 643, '+70', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(178, 7, 'RW', 'رواندا', 'Rwanda', 'RWA', 646, '+250', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(179, 7, 'SH', 'سانت هيلينا', 'Saint Helena', 'SHN', 654, '+290', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(180, 7, 'KN', 'سانت كيتس ونيفيس', 'Saint Kitts And Nevis', 'KNA', 659, '+1869', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(181, 7, 'LC', 'سانت لوسيا', 'Saint Lucia', 'LCA', 662, '+1758', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(182, 7, 'PM', 'سانت بيير وميكلون', 'Saint Pierre And Miquelon', 'SPM', 666, '+508', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(183, 7, 'VC', 'سانت فنسنت وجزر غرينادين', 'Saint Vincent And The Grenadines', 'VCT', 670, '+1784', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(184, 7, 'WS', 'ساموا', 'Samoa', 'WSM', 882, '+684', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(185, 7, 'SM', 'سان مارينو', 'San Marino', 'SMR', 674, '+378', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(186, 7, 'ST', 'ساو توم و برينسيب', 'Sao Tome And Principe', 'STP', 678, '+239', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(187, 3, 'SA', 'السعودية', 'Saudi Arabia', 'SAU', 682, '+966', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 01:16:37'),
(188, 7, 'SN', 'السنغال', 'Senegal', 'SEN', 686, '+221', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(189, 7, 'CS', 'صربيا ومونتينيغرو', 'Serbia And Montenegro', NULL, NULL, '+381', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(190, 7, 'SC', 'سيشل', 'Seychelles', 'SYC', 690, '+248', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(191, 7, 'SL', 'سيراليون', 'Sierra Leone', 'SLE', 694, '+232', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(192, 7, 'SG', 'سنغافورة', 'Singapore', 'SGP', 702, '+65', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(193, 7, 'SK', 'سلوفاكيا', 'Slovakia', 'SVK', 703, '+421', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(194, 7, 'SI', 'سلوفينيا', 'Slovenia', 'SVN', 705, '+386', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(195, 7, 'SB', 'جزر سليمان', 'Solomon Islands', 'SLB', 90, '+677', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(196, 7, 'SO', 'الصومال', 'Somalia', 'SOM', 706, '+252', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(197, 7, 'ZA', 'جنوب أفريقيا', 'South Africa', 'ZAF', 710, '+27', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(198, 7, 'GS', 'جورجيا الجنوبية وجزر ساندويتش الجنوبية', 'South Georgia And The South Sandwich Islands', NULL, NULL, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(199, 7, 'ES', 'آسبانيا', 'Spain', 'ESP', 724, '+34', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(200, 7, 'LK', 'سيريلانكا', 'Sri Lanka', 'LKA', 144, '+94', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(201, 7, 'SD', 'السودان', 'Sudan', 'SDN', 736, '+249', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(202, 7, 'SR', 'سورينام', 'Suriname', 'SUR', 740, '+597', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(203, 7, 'SJ', 'سفالبارد وجان ماين', 'Svalbard And Jan Mayen', 'SJM', 744, '+47', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(204, 7, 'SZ', 'سوازيلاند', 'Swaziland', 'SWZ', 748, '+268', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(205, 7, 'SE', 'السويد', 'Sweden', 'SWE', 752, '+46', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(206, 7, 'CH', 'سويسرا', 'Switzerland', 'CHE', 756, '+41', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(207, 7, 'SY', 'سوريا', 'Syria', 'SYR', 760, '+963', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(208, 7, 'TW', 'تايوان', 'Taiwan', 'TWN', 158, '+886', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(209, 7, 'TJ', 'طاجيكستان', 'Tajikistan', 'TJK', 762, '+992', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(210, 7, 'TZ', 'تنزانيا', 'Tanzania', 'TZA', 834, '+255', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(211, 7, 'TH', 'تايلاند', 'Thailand', 'THA', 764, '+66', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(212, 7, 'TL', 'تيمور ليست', 'Timor-leste', NULL, NULL, '+670', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(213, 7, 'TG', 'توغو', 'Togo', 'TGO', 768, '+228', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(214, 7, 'TK', 'توكيلاو', 'Tokelau', 'TKL', 772, '+690', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(215, 7, 'TO', 'تونجا', 'Tonga', 'TON', 776, '+676', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(216, 7, 'TT', 'ترينداد وتوباغو', 'Trinidad And Tobago', 'TTO', 780, '+1868', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(217, 7, 'TN', 'تونس', 'Tunisia', 'TUN', 788, '+216', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(218, 7, 'TR', 'تركيا', 'Turkey', 'TUR', 792, '+90', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(219, 7, 'TM', 'تركمانستان', 'Turkmenistan', 'TKM', 795, '+7370', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(220, 7, 'TC', 'جزر تركس وكايكوس', 'Turks And Caicos Islands', 'TCA', 796, '+1649', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(221, 7, 'TV', 'توفالو', 'Tuvalu', 'TUV', 798, '+688', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(222, 7, 'UG', 'أوغندا', 'Uganda', 'UGA', 800, '+256', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(223, 7, 'UA', 'أوكرانيا', 'Ukraine', 'UKR', 804, '+380', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(224, 4, 'AE', 'الإمارات', 'United Arab Emirates', 'ARE', 784, '+971', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 01:16:54'),
(225, 7, 'GB', 'المملكة المتحدة', 'United Kingdom', 'GBR', 826, '+44', '٣-٥ أيام', '3-5 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-29 13:22:24'),
(226, 7, 'US', 'الولايات المتحدة الأمريكية', 'United States', 'USA', 840, '+1', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(227, 7, 'UM', 'جزر الولايات المتحدة البعيدة الصغرى', 'United States Minor Outlying Islands', NULL, NULL, '+1', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(228, 7, 'UY', 'أوروجواي', 'Uruguay', 'URY', 858, '+598', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(229, 7, 'UZ', 'أوزبيكستان', 'Uzbekistan', 'UZB', 860, '+998', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(230, 7, 'VU', 'فانواتو', 'Vanuatu', 'VUT', 548, '+678', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(231, 7, 'VE', 'فنزويلا', 'Venezuela', 'VEN', 862, '+58', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(232, 7, 'VN', 'فيتنام', 'Viet Nam', 'VNM', 704, '+84', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(233, 7, 'VG', 'جزر فيرجن البريطانية', 'Virgin Islands, British', 'VGB', 92, '+1284', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(234, 7, 'VI', 'جزر فيرجن ، الولايات المتحدة', 'Virgin Islands, U.s.', 'VIR', 850, '+1340', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(235, 7, 'WF', 'واليس وفوتونا', 'Wallis And Futuna', 'WLF', 876, '+681', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(236, 7, 'EH', 'الصحراء الغربية', 'Western Sahara', 'ESH', 732, '+212', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(237, 7, 'YE', 'اليمن', 'Yemen', 'YEM', 887, '+967', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(238, 7, 'ZM', 'زامبيا', 'Zambia', 'ZMB', 894, '+260', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(239, 7, 'ZW', 'زمبابوي', 'Zimbabwe', 'ZWE', 716, '+263', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(240, 7, 'RS', 'صربيا', 'Serbia', 'SRB', 688, '+381', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(241, 7, 'AP', 'منطقة آسيا والمحيط الهادئ', 'Asia Pacific Region', '0', 0, '+0', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(242, 7, 'ME', 'مونتينيغرو', 'Montenegro', 'MNE', 499, '+382', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(243, 7, 'AX', 'جزر آلاند', 'Aland Islands', 'ALA', 248, '+358', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(244, 7, 'BQ', 'بوناير وسينت أوستاتيوس وسابا', 'Bonaire, Sint Eustatius And Saba', 'BES', 535, '+599', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(245, 7, 'CW', 'كوراكاو', 'Curacao', 'CUW', 531, '+599', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(246, 7, 'GG', 'جيرنسي', 'Guernsey', 'GGY', 831, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(247, 7, 'IM', 'جزيرة آيل أوف مان', 'Isle Of Man', 'IMN', 833, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(248, 7, 'JE', 'جيرسي', 'Jersey', 'JEY', 832, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(249, 7, 'XK', 'كوسوفو', 'Kosovo', '---', 0, '+381', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(250, 7, 'BL', 'سانت بارتيليمي', 'Saint Barthelemy', 'BLM', 652, '+590', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(251, 7, 'MF', 'سانت مارتن', 'Saint Martin', 'MAF', 663, '+590', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(252, 7, 'SX', 'سينت مارتن', 'Sint Maarten', 'SXM', 534, '+1', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(253, 7, 'SS', 'جنوب السودان', 'South Sudan', 'SSD', 728, '+211', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-06-14 00:03:32', '2021-06-26 04:15:10'),
(255, 7, 'TP', 'East Timor', 'East Timor', '', NULL, '+670', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:40', '2021-07-04 03:04:18'),
(256, 7, 'XA', 'External Territories of Australia', 'External Territories of Australia', '', NULL, '+61', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:40', '2021-07-04 03:04:21'),
(257, 7, 'XU', 'Guernsey and Alderney', 'Guernsey and Alderney', '', NULL, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:41', '2021-07-04 03:04:25'),
(258, 7, 'XJ', 'Jersey', 'Jersey', '', NULL, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:41', '2021-07-04 03:04:28'),
(259, 7, 'XM', 'Man (Isle of)', 'Man (Isle of)', '', NULL, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:42', '2021-07-04 03:04:32'),
(260, 7, 'XG', 'Smaller Territories of the UK', 'Smaller Territories of the UK', '', NULL, '+44', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:42', '2021-07-04 03:04:34'),
(261, 7, 'YU', 'Yugoslavia', 'Yugoslavia', '', NULL, '+38', '٥-٧ أيام', '5-7 days', '', '', '', '', 'yes', '2021-07-04 03:02:42', '2021-07-04 03:04:38');

-- --------------------------------------------------------

--
-- Table structure for table `currencies`
--

CREATE TABLE `currencies` (
  `id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_currency` varchar(255) NOT NULL,
  `en_currency` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `currency` varchar(255) NOT NULL,
  `currency_format` int(11) NOT NULL,
  `equal` double(8,3) NOT NULL,
  `sort` int(11) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `currencies`
--

INSERT INTO `currencies` (`id`, `ar_name`, `en_name`, `ar_currency`, `en_currency`, `image`, `currency`, `currency_format`, `equal`, `sort`, `active`, `created_at`, `updated_at`) VALUES
(1, 'دينار كويتي', 'Kuwaiti Dinar', 'دينار', 'KWD', 'KWD.png', 'KWD', 3, 1.000, 1, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:10:37'),
(2, 'دينار بحريني', 'Bahraini Dinar', 'دينار', 'BHD', 'BHD.png', 'BHD', 3, 0.810, 2, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:11:00'),
(3, 'ريال سعودي', 'Saudi Riyal', 'ريال', 'SAR', 'SAR.png', 'SAR', 2, 0.082, 3, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:12:59'),
(4, 'درهم إماراتي', 'Arab Emirates Dirham', 'درهم', 'AED', 'AED.png', 'AED', 2, 0.083, 4, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:13:30'),
(5, 'ريال قطري', 'Qatari Riyal', 'ريال', 'QAR', 'QAR.png', 'QAR', 2, 0.084, 5, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:12:20'),
(6, 'ريال عماني', 'Omani Riyal', 'ريال', 'OMR', 'OMR.png', 'OMR', 2, 0.800, 6, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:13:52'),
(7, 'دولار أمريكي', 'United Stated Dollar', 'دولار', 'USD', 'USD.png', 'USD', 2, 0.310, 7, 'yes', '2021-06-08 01:35:30', '2023-03-28 18:14:12');

-- --------------------------------------------------------

--
-- Table structure for table `donations`
--

CREATE TABLE `donations` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `rel_id` int(11) NOT NULL,
  `gift_id` int(11) NOT NULL,
  `type` enum('one','always') NOT NULL,
  `category` enum('projects','teachers','families','childern','general') NOT NULL,
  `pay_type` enum('knet','master','visit','headquarter') NOT NULL,
  `amount` double(8,3) NOT NULL,
  `active` enum('unpaid','yes','yet','no') NOT NULL,
  `day` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `user_type` enum('user','visitor') NOT NULL,
  `payment_id` varchar(255) NOT NULL,
  `transaction_id` varchar(255) NOT NULL,
  `ar_currency` varchar(255) NOT NULL,
  `en_currency` varchar(255) NOT NULL,
  `format` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `donations`
--

INSERT INTO `donations` (`id`, `user_id`, `rel_id`, `gift_id`, `type`, `category`, `pay_type`, `amount`, `active`, `day`, `name`, `user_type`, `payment_id`, `transaction_id`, `ar_currency`, `en_currency`, `format`, `created_at`, `updated_at`) VALUES
(1, 1, 1, 0, 'always', 'childern', 'visit', 100.000, 'no', 2, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 11:21:23', '2023-08-02 13:19:38'),
(2, 1, 1, 0, 'always', 'teachers', 'visit', 100.000, 'yes', 2, '', 'visitor', '', '', 'دينار', 'KWD', 3, '2023-08-02 11:22:34', '2023-08-02 12:16:20'),
(3, 1, 1, 0, 'always', 'families', 'knet', 100.000, 'yet', 2, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 11:28:27', '2023-08-02 13:22:32'),
(4, 1, 1, 0, 'always', 'teachers', 'knet', 100.000, 'yes', 2, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 11:36:38', '2023-08-02 11:44:39'),
(5, 1, 1, 4, 'one', 'teachers', 'knet', 5.000, 'yes', 0, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 11:42:20', '2023-08-02 13:26:04'),
(6, 1, 1, 0, 'one', 'projects', 'knet', 20.000, 'yes', 0, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 18:02:42', '2023-08-02 18:03:02'),
(7, 1, 0, 0, 'always', 'general', 'knet', 100.000, 'yes', 3, '', 'user', '', '', 'دينار', 'KWD', 3, '2023-08-02 23:37:25', '2023-08-02 23:38:16'),
(8, 2, 1, 0, 'one', 'families', 'knet', 50.000, 'unpaid', 0, '', 'visitor', '', '', 'دينار', 'KWD', 3, '2023-08-05 13:25:52', '2023-08-05 13:25:52'),
(9, 3, 1, 0, 'always', 'families', 'knet', 50.000, 'yes', 5, '', 'visitor', '2305231707086018438', '321701001211887', 'دينار', 'KWD', 3, '2023-08-05 15:06:20', '2023-08-05 15:07:34');

-- --------------------------------------------------------

--
-- Table structure for table `families`
--

CREATE TABLE `families` (
  `id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `gender` enum('male','female') NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_nationality` varchar(255) NOT NULL,
  `en_nationality` varchar(255) NOT NULL,
  `civil_id` varchar(255) NOT NULL,
  `ar_parent_status` varchar(255) NOT NULL,
  `en_parent_status` varchar(255) NOT NULL,
  `death_date` varchar(255) NOT NULL,
  `ar_death_reason` varchar(255) NOT NULL,
  `en_death_reason` varchar(255) NOT NULL,
  `members_count` int(11) NOT NULL,
  `males` int(11) NOT NULL,
  `females` int(11) NOT NULL,
  `ar_responsible` varchar(255) NOT NULL,
  `en_responsible` varchar(255) NOT NULL,
  `ar_relative` varchar(255) NOT NULL,
  `en_relative` varchar(255) NOT NULL,
  `ar_career` varchar(255) NOT NULL,
  `en_career` varchar(255) NOT NULL,
  `ar_career_status` varchar(255) NOT NULL,
  `en_career_status` varchar(255) NOT NULL,
  `responsible_civil_id` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `required` enum('no','yes') NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `families`
--

INSERT INTO `families` (`id`, `country_id`, `gender`, `ar_name`, `en_name`, `ar_nationality`, `en_nationality`, `civil_id`, `ar_parent_status`, `en_parent_status`, `death_date`, `ar_death_reason`, `en_death_reason`, `members_count`, `males`, `females`, `ar_responsible`, `en_responsible`, `ar_relative`, `en_relative`, `ar_career`, `en_career`, `ar_career_status`, `en_career_status`, `responsible_civil_id`, `image`, `amount`, `required`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 114, 'male', 'محمود أحمد محمد', 'Mahmoud Ahmed Mohammed', 'كوتي', 'Kuwaiti', '29100034234234', 'متوفي', 'Died', '2014-11-12', 'وفاة طبيعية', 'Natural Death', 5, 3, 2, 'محمد وحيد', 'Mohamed Wahed', 'الجد', 'Grandfather', 'طبيب', 'Doctor', 'طبيب متقاعد', 'Retired doctor', '3423423423434', 'HNBzp.image 16.png', 50.000, 'yes', 'yes', '2023-07-24 12:37:34', '2023-07-24 13:17:34', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `families_donations`
--

CREATE TABLE `families_donations` (
  `id` int(11) NOT NULL,
  `family_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `active` enum('unpaid','yes','yet','no') NOT NULL,
  `day` int(11) NOT NULL,
  `payment_id` varchar(255) NOT NULL,
  `transaction_id` varchar(255) NOT NULL,
  `user_type` enum('user','visitor') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `families_members`
--

CREATE TABLE `families_members` (
  `id` int(11) NOT NULL,
  `family_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `birth_date` varchar(255) NOT NULL,
  `gender` enum('male','female') NOT NULL,
  `ar_civil_type` varchar(255) NOT NULL,
  `en_civil_type` varchar(255) NOT NULL,
  `civil_id` varchar(255) NOT NULL,
  `ar_career_status` varchar(255) NOT NULL,
  `en_career_status` varchar(255) NOT NULL,
  `ar_class` varchar(255) NOT NULL,
  `en_class` varchar(255) NOT NULL,
  `ar_healthy` varchar(255) NOT NULL,
  `en_healthy` varchar(255) NOT NULL,
  `ar_psychological` varchar(255) NOT NULL,
  `en_psychological` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `families_members`
--

INSERT INTO `families_members` (`id`, `family_id`, `ar_name`, `en_name`, `birth_date`, `gender`, `ar_civil_type`, `en_civil_type`, `civil_id`, `ar_career_status`, `en_career_status`, `ar_class`, `en_class`, `ar_healthy`, `en_healthy`, `ar_psychological`, `en_psychological`, `image`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'محمد', 'Mohamed', '2020-06-24', 'male', 'جواز سفر', 'Passport', '34234234234234', 'لا يعمل', 'No work', 'الصف الاول الإبتدائي', 'First grade', 'عادية', 'Normal', 'جيدة', 'Good', 'yvoLe.image 16.png', 'yes', '2023-07-24 13:08:29', '2023-07-24 13:17:26'),
(2, 1, 'محمد', 'Mohamed', '2020-06-24', 'male', 'جواز سفر', 'Passport', '34234234234234', 'لا يعمل', 'No work', 'الصف الاول الإبتدائي', 'First grade', 'عادية', 'Normal', 'جيدة', 'Good', 'yvoLe.image 16.png', 'yes', '2023-07-24 13:08:29', '2023-07-24 13:17:26');

-- --------------------------------------------------------

--
-- Table structure for table `families_reports`
--

CREATE TABLE `families_reports` (
  `id` int(11) NOT NULL,
  `family_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `families_reports`
--

INSERT INTO `families_reports` (`id`, `family_id`, `ar_name`, `en_name`, `file`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'تقرير ١', 'Report 1', '5zvOq.image 16.png', 'yes', '2023-07-24 12:41:38', '2023-07-24 12:41:38');

-- --------------------------------------------------------

--
-- Table structure for table `gifts`
--

CREATE TABLE `gifts` (
  `id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `sort` int(11) NOT NULL,
  `type` enum('teachers','families','childern') NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `gifts`
--

INSERT INTO `gifts` (`id`, `ar_name`, `en_name`, `image`, `amount`, `sort`, `type`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 'عيدية', 'Eid Gift', 'uoM1g.image 16.png', 5.000, 1, 'childern', 'yes', '2023-07-29 04:27:46', '2023-07-29 04:30:37', NULL),
(2, 'عيدية', 'Eid Gift', 'uoM1g.image 16.png', 5.000, 1, 'families', 'yes', '2023-07-29 04:27:46', '2023-07-29 04:30:37', NULL),
(3, 'عيدية', 'Eid Gift', 'uoM1g.image 16.png', 15.000, 2, 'families', 'yes', '2023-07-29 04:27:46', '2023-07-29 04:30:37', NULL),
(4, 'عيدية', 'Eid Gift', 'uoM1g.image 16.png', 5.000, 1, 'teachers', 'yes', '2023-07-29 04:27:46', '2023-07-29 04:30:37', NULL),
(5, 'عيدية', 'Eid Gift', 'uoM1g.image 16.png', 15.000, 2, 'teachers', 'yes', '2023-07-29 04:27:46', '2023-07-29 04:30:37', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `groups`
--

CREATE TABLE `groups` (
  `id` int(10) UNSIGNED NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `type` enum('admin','seller') NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `groups`
--

INSERT INTO `groups` (`id`, `ar_name`, `en_name`, `type`, `created_at`, `updated_at`) VALUES
(1, 'الإدراة العليا', 'Top Management', 'admin', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `ideas`
--

CREATE TABLE `ideas` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `type` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `reply` text NOT NULL,
  `seen` enum('no','yes') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `ideas`
--

INSERT INTO `ideas` (`id`, `name`, `phone`, `email`, `type`, `message`, `reply`, `seen`, `created_at`, `updated_at`) VALUES
(1, 'Ahmed Kamal', '50733441', 'info@domain.com', 'marketing', 'hello world', '', 'yes', '2023-05-20 12:20:59', '2023-05-20 12:33:43'),
(2, 'dasd', '23123', 'dsad@das.dsa', 'seminars', 'sa das d as dasd', '', 'no', '2023-07-31 12:04:46', '2023-07-31 12:04:46');

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '2014_10_12_000000_create_users_table', 1),
(2, '2014_10_12_100000_create_password_resets_table', 1),
(3, '2017_10_25_114136_create_visitors_table', 1),
(4, '2017_10_25_114353_create_permissions_table', 1),
(5, '2017_10_25_152904_create_groups_table', 1),
(6, '2017_12_09_140937_create_api_key_table', 1),
(7, '2017_10_25_114114_create_sites_table', 2),
(8, '2017_11_27_230559_create_contact_table', 3),
(9, '2017_10_28_213328_create_pages_table', 4),
(11, '2017_10_25_114258_create_countries_table', 5),
(12, '2018_11_04_111253_create_brands_table', 6),
(14, '2018_11_04_124434_create_categories_table', 7),
(16, '2018_11_04_162506_create_departments_table', 8),
(18, '2018_11_05_104440_create_department_categories_table', 9),
(19, '2017_10_25_114309_create_governates_table', 10),
(21, '2017_10_25_114316_create_cities_table', 11),
(22, '2018_11_05_170008_create_sizes_table', 12),
(23, '2018_11_05_174012_create_colors_table', 13),
(27, '2018_11_06_114309_create_coupons_table', 14),
(28, '2018_11_06_143331_create_about_table', 15),
(29, '2018_11_06_150631_create_offers_table', 16),
(30, '2018_11_06_151122_create_products_table', 17),
(32, '2018_11_07_105847_add_col_to_users_table', 18),
(40, '2018_11_07_121752_create_products_table', 19),
(41, '2018_11_07_122715_create_product_prices_table', 19),
(42, '2018_11_11_115356_add_sub_titles_cols_to_departments', 20),
(43, '2018_11_11_154248_add_desc_cols_to_products_table', 21),
(44, '2018_11_12_170009_add_wishlist_col_to_users_table', 22),
(45, '2018_11_13_175408_add_quantity_col_to_products_table', 22),
(46, '2018_11_14_121849_add_store_address_store_name_for_users_table', 22),
(47, '2018_11_14_122156_add_active_cols_in_departments_table', 23),
(48, '2018_11_14_122156_add_active_cols_in_brands_table', 24),
(49, '2018_11_14_122156_add_active_cols_in_categories_table ', 25);

-- --------------------------------------------------------

--
-- Table structure for table `newsletters`
--

CREATE TABLE `newsletters` (
  `id` int(10) UNSIGNED NOT NULL,
  `email` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `newsletters`
--

INSERT INTO `newsletters` (`id`, `email`, `created_at`, `updated_at`) VALUES
(1, 'info@domain.com', '2023-05-05 12:25:37', '2023-05-05 12:25:37'),
(2, 'info@domian.com', '2023-07-30 08:55:08', '2023-07-30 08:55:08');

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE `notifications` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `platform` varchar(255) NOT NULL,
  `ar_title` varchar(255) NOT NULL,
  `en_title` varchar(255) NOT NULL,
  `ar_message` text NOT NULL,
  `en_message` text NOT NULL,
  `rel_id` int(11) NOT NULL,
  `to_id` int(11) NOT NULL,
  `type` enum('text','image') NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `pages`
--

CREATE TABLE `pages` (
  `id` int(10) UNSIGNED NOT NULL,
  `ar_title` varchar(255) NOT NULL,
  `en_title` varchar(255) NOT NULL,
  `ar_desc` text NOT NULL,
  `en_desc` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `pages`
--

INSERT INTO `pages` (`id`, `ar_title`, `en_title`, `ar_desc`, `en_desc`, `image`, `created_at`, `updated_at`) VALUES
(1, 'نبذة عن غرس', 'About Ghars', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>\r\n\r\n<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>\r\n\r\n<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'Vy9vV.a1.png', '2021-06-08 20:06:17', '2023-07-30 09:13:15'),
(2, 'إكتشف المزيد عن غرس', 'Find out more about Ghars', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>\r\n\r\n<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>\r\n\r\n<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'wrjJR.abt.png', '2021-06-08 20:08:22', '2023-07-30 09:25:44'),
(3, 'إكتشف المزيد عن غرس ٢', 'Find out more about Ghars 2', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>\r\n\r\n<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>\r\n\r\n<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'yv8Tq.blue.png', '2021-06-08 20:08:46', '2023-07-31 10:15:41'),
(4, 'إكتشف المزيد عن غرس ٣', 'Find out more about Ghars 3', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>\r\n\r\n<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>\r\n\r\n<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'NBqoi.map.png', '2021-06-08 20:08:46', '2023-07-31 10:17:18');

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `password_resets`
--

INSERT INTO `password_resets` (`email`, `token`, `created_at`, `updated_at`) VALUES
('dd6@spark-cloud.con', 'WjwFr3aGpd64g2cZIh7oeQ0P1625759297', '2021-07-08 15:48:17', '2021-07-08 15:48:17'),
('ibrahim@gmail.com', 't6gbun8aswemMyiv4EUZ5x7Q1630402178', '2021-08-31 09:29:38', '2021-08-31 09:29:38'),
('ibrahim1997hamed@gmail.com', 'xZXUKFeTtkujsWYSby0cGCVE1630403189', '2021-08-31 09:46:29', '2021-08-31 09:46:29'),
('info@domain.com', 'COFkqmKgzhB8pDNViIEodWba1690802902', '2023-07-31 11:28:22', '2023-07-31 11:28:22'),
('user@domain.com', 'sMQv7YiaRLHpISFhP5DburjB1691068543', '2023-08-03 14:15:43', '2023-08-03 14:15:43');

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` int(10) UNSIGNED NOT NULL,
  `group_id` int(11) NOT NULL,
  `permission` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `group_id`, `permission`, `created_at`, `updated_at`) VALUES
(3002, 1, 'site_edit', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3003, 1, 'social_media_all', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3004, 1, 'social_media_edit', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3005, 1, 'currencies_all', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3006, 1, 'currencies_edit', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3007, 1, 'countries_all', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3008, 1, 'countries_edit', '2023-08-02 12:03:35', '2023-08-02 12:03:35'),
(3009, 1, 'log_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3010, 1, 'notifications_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3011, 1, 'notifications_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3012, 1, 'groups_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3013, 1, 'groups_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3014, 1, 'groups_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3015, 1, 'groups_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3016, 1, 'admins_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3017, 1, 'admins_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3018, 1, 'admins_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3019, 1, 'admins_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3020, 1, 'users_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3021, 1, 'users_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3022, 1, 'users_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3023, 1, 'users_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3024, 1, 'visitors_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3025, 1, 'companies_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3026, 1, 'companies_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3027, 1, 'companies_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3028, 1, 'portfolio_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3029, 1, 'portfolio_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3030, 1, 'portfolio_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3031, 1, 'portfolio_show', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3032, 1, 'portfolio_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3033, 1, 'ideas_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3034, 1, 'ideas_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3035, 1, 'categories_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3036, 1, 'categories_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3037, 1, 'categories_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3038, 1, 'categories_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3039, 1, 'projects_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3040, 1, 'projects_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3041, 1, 'projects_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3042, 1, 'projects_show', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3043, 1, 'gifts_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3044, 1, 'gifts_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3045, 1, 'gifts_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3046, 1, 'gifts_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3047, 1, 'childern_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3048, 1, 'childern_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3049, 1, 'childern_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3050, 1, 'childern_show', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3051, 1, 'families_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3052, 1, 'families_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3053, 1, 'families_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3054, 1, 'families_show', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3055, 1, 'teachers_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3056, 1, 'teachers_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3057, 1, 'teachers_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3058, 1, 'teachers_show', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3059, 1, 'donations_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3060, 1, 'donations_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3061, 1, 'tutorials_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3062, 1, 'tutorials_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3063, 1, 'tutorials_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3064, 1, 'tutorials_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3065, 1, 'ads_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3066, 1, 'ads_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3067, 1, 'ads_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3068, 1, 'ads_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3069, 1, 'slider_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3070, 1, 'slider_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3071, 1, 'slider_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3072, 1, 'slider_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3073, 1, 'pages_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3074, 1, 'pages_add', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3075, 1, 'pages_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3076, 1, 'pages_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3077, 1, 'contact_all', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3078, 1, 'contact_edit', '2023-08-02 12:03:36', '2023-08-02 12:03:36'),
(3079, 1, 'contact_delete', '2023-08-02 12:03:36', '2023-08-02 12:03:36');

-- --------------------------------------------------------

--
-- Table structure for table `projects`
--

CREATE TABLE `projects` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `company_id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `step_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_desc` text NOT NULL,
  `en_desc` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `collect` double(8,3) NOT NULL,
  `start_date` varchar(255) NOT NULL,
  `end_date` varchar(255) NOT NULL,
  `type` enum('public','private') NOT NULL,
  `required` enum('no','yes') NOT NULL,
  `active` enum('yet','yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `projects`
--

INSERT INTO `projects` (`id`, `user_id`, `company_id`, `country_id`, `category_id`, `step_id`, `ar_name`, `en_name`, `ar_desc`, `en_desc`, `image`, `amount`, `collect`, `start_date`, `end_date`, `type`, `required`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 6, 238, 5, 1, 'مشروع ١', 'Project 1', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'frkwn.Screen Shot 2023-05-20 at 11.20.07 AM.png', 80000.000, 20000.000, '2023-01-01', '2024-01-01', 'public', 'no', 'yes', '2023-05-20 13:16:19', '2023-08-02 18:23:55'),
(2, 1, 0, 114, 4, 0, 'Ali Mobarak School', 'Ali Mobarak School', 'Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description', 'Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description  Project Description', 'ytwoR.a2.png', 99999.999, 10000.000, '', '', 'private', 'no', 'yet', '2023-08-02 23:07:20', '2023-08-02 23:07:20');

-- --------------------------------------------------------

--
-- Table structure for table `projects_reports`
--

CREATE TABLE `projects_reports` (
  `id` int(11) NOT NULL,
  `project_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `active` enum('yet','yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `projects_reports`
--

INSERT INTO `projects_reports` (`id`, `project_id`, `ar_name`, `en_name`, `file`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'تقرير ١', 'report 1', 'LxNt7.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yes', '2023-05-20 13:24:39', '2023-08-02 17:53:45'),
(2, 1, 'تقرير ٢', 'report 2', 'D2kR7.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yet', '2023-05-20 16:29:55', '2023-05-20 16:29:55');

-- --------------------------------------------------------

--
-- Table structure for table `site`
--

CREATE TABLE `site` (
  `id` int(10) UNSIGNED NOT NULL,
  `ar_title` varchar(255) DEFAULT NULL,
  `en_title` varchar(255) DEFAULT NULL,
  `ar_desc` text DEFAULT NULL,
  `en_desc` text DEFAULT NULL,
  `tags` varchar(255) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `whatsapp` varchar(255) NOT NULL,
  `map` text NOT NULL,
  `ios` varchar(255) NOT NULL,
  `ios_version` varchar(255) NOT NULL,
  `ios_version_text` varchar(255) NOT NULL,
  `android` varchar(255) NOT NULL,
  `android_version` varchar(255) NOT NULL,
  `childern` varchar(255) NOT NULL,
  `families` varchar(255) NOT NULL,
  `teachers` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `site`
--

INSERT INTO `site` (`id`, `ar_title`, `en_title`, `ar_desc`, `en_desc`, `tags`, `email`, `phone`, `whatsapp`, `map`, `ios`, `ios_version`, `ios_version_text`, `android`, `android_version`, `childern`, `families`, `teachers`, `created_at`, `updated_at`) VALUES
(1, 'غرس', 'Ghars', 'هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها', 'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout', 'Ghars , غرس', 'info@domian.com', '96550733441', '96550733441', 'https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3623.650859370141!2d46.64176368475698!3d24.738863956212338!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3e2ee36823527cdb%3A0x67b0574b6b8f0d27!2sMCIT!5e0!3m2!1sar!2seg!4v1632406153544!5m2!1sar!2seg', 'https://www.google.com/', '1.0', '1.0.0', 'https://www.google.com/', '1.0', '3OQyI.g22.png', '7K6bY.g11.png', 'Hwcf1.g33.png', '2018-11-04 08:51:58', '2023-08-02 12:34:31');

-- --------------------------------------------------------

--
-- Table structure for table `slider`
--

CREATE TABLE `slider` (
  `id` int(11) NOT NULL,
  `ar_name` text NOT NULL,
  `en_name` text NOT NULL,
  `ar_desc` text NOT NULL,
  `en_desc` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `sort` int(11) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `link` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COLLATE=utf8mb3_general_ci;

--
-- Dumping data for table `slider`
--

INSERT INTO `slider` (`id`, `ar_name`, `en_name`, `ar_desc`, `en_desc`, `image`, `sort`, `active`, `link`, `created_at`, `updated_at`) VALUES
(4, 'غرس : بوابة المتبرعين والمتطوعين', 'Ghars: Donors and Volunteers Portal', 'مشروع لبناء فصول دراسية في تنزانيا (المرحلة الثانية ) ...وذلك لتلقي العلم والفقه في الدين فبالعلم ترقى الأمم والمجتمعات وتقضي على الفقر وخاصةً علومُ الشريعةِ الإسلاميةِ السمحة والعلوم التطبيقة التي تفيد المجتمع.', 'A project to build classrooms in Tanzania (the second phase) ... in order to receive knowledge and jurisprudence in religion. With knowledge, nations and societies rise up and eradicate poverty, especially the sciences of tolerant Islamic law and applied sciences that benefit society.', 'IN3zR.header.png', 1, 'yes', 'https://www.google.com/', '2023-05-20 09:50:50', '2023-07-30 09:05:55');

-- --------------------------------------------------------

--
-- Table structure for table `social_media`
--

CREATE TABLE `social_media` (
  `id` int(11) NOT NULL,
  `type` varchar(255) NOT NULL,
  `link` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `social_media`
--

INSERT INTO `social_media` (`id`, `type`, `link`, `created_at`, `updated_at`) VALUES
(5, 'twitter', 'https://twitter.com/', '2021-06-10 09:28:37', '2023-03-28 17:45:59'),
(6, 'instagram', 'https://www.instagram.com/', '2021-06-10 09:28:50', '2023-03-28 17:46:04'),
(7, 'facebook', 'https://www.facebook.com/', '2021-06-10 09:28:59', '2023-03-28 17:46:08'),
(8, 'youtube', 'https://www.youtube.com/', '2021-06-10 09:28:59', '2023-03-28 17:46:14');

-- --------------------------------------------------------

--
-- Table structure for table `teachers`
--

CREATE TABLE `teachers` (
  `id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `gender` enum('male','female') NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_nationality` varchar(255) NOT NULL,
  `en_nationality` varchar(255) NOT NULL,
  `birth_date` varchar(255) NOT NULL,
  `ar_address` varchar(255) NOT NULL,
  `en_address` varchar(255) NOT NULL,
  `ar_status` varchar(255) NOT NULL,
  `en_status` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `required` enum('no','yes') NOT NULL,
  `ar_qualification` varchar(255) NOT NULL,
  `en_qualification` varchar(255) NOT NULL,
  `ar_qualification_source` varchar(255) NOT NULL,
  `en_qualification_source` varchar(255) NOT NULL,
  `qualification_date` varchar(255) NOT NULL,
  `ar_specialization` varchar(255) NOT NULL,
  `en_specialization` varchar(255) NOT NULL,
  `ar_career` varchar(255) NOT NULL,
  `en_career` varchar(255) NOT NULL,
  `ar_invitation` text NOT NULL,
  `en_invitation` text NOT NULL,
  `ar_social` text NOT NULL,
  `en_social` text NOT NULL,
  `ar_quran` varchar(255) NOT NULL,
  `en_quran` varchar(255) NOT NULL,
  `ar_skills` text NOT NULL,
  `en_skills` text NOT NULL,
  `responsible_country_id` int(11) NOT NULL,
  `ar_responsible_address` varchar(255) NOT NULL,
  `en_responsible_address` varchar(255) NOT NULL,
  `responsible_email` varchar(255) NOT NULL,
  `responsible_phone` varchar(255) NOT NULL,
  `ar_responsible` varchar(255) NOT NULL,
  `en_responsible` varchar(255) NOT NULL,
  `active` enum('yes','no','delete') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `deleted_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `teachers`
--

INSERT INTO `teachers` (`id`, `country_id`, `gender`, `ar_name`, `en_name`, `ar_nationality`, `en_nationality`, `birth_date`, `ar_address`, `en_address`, `ar_status`, `en_status`, `phone`, `email`, `image`, `amount`, `required`, `ar_qualification`, `en_qualification`, `ar_qualification_source`, `en_qualification_source`, `qualification_date`, `ar_specialization`, `en_specialization`, `ar_career`, `en_career`, `ar_invitation`, `en_invitation`, `ar_social`, `en_social`, `ar_quran`, `en_quran`, `ar_skills`, `en_skills`, `responsible_country_id`, `ar_responsible_address`, `en_responsible_address`, `responsible_email`, `responsible_phone`, `ar_responsible`, `en_responsible`, `active`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 114, 'male', 'أحمد مراد', 'Ahmed Morad', 'كويتي', 'Kuwaiti', '1990-05-01', 'شرق', 'Sharq', 'أعزب', 'Single', '50733441', 'info@domain.com', 'gDkcb.image 16.png', 100.000, 'yes', 'حقوق', 'Law', 'جامعة الكويت', 'Kuwait University', '2020-02-19', 'علوم دين', 'Religious sciences', 'داعية', 'Teacher', 'النشاط الدعوي', 'Advocacy Activity', 'النشاط الإجتماعي', 'Social Activity', 'كامل', 'All', 'كرة القدم', 'Football', 114, 'حولي', 'Hawaly', 'mohamed@domain.com', '324234234', 'محمد', 'Mohamed', 'yes', '2023-07-25 05:13:21', '2023-07-25 05:13:21', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `teachers_donations`
--

CREATE TABLE `teachers_donations` (
  `id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `amount` double(8,3) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `active` enum('unpaid','yes','no') NOT NULL,
  `day` int(11) NOT NULL,
  `user_type` enum('user','visitors') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `teachers_reports`
--

CREATE TABLE `teachers_reports` (
  `id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `teachers_reports`
--

INSERT INTO `teachers_reports` (`id`, `teacher_id`, `ar_name`, `en_name`, `file`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'تقرير ١', 'Report 1', 'xVC6c.larm-rmah-AEaTUnvneik-unsplash 1.png', 'yes', '2023-07-25 05:13:21', '2023-07-25 05:13:21');

-- --------------------------------------------------------

--
-- Table structure for table `teachers_videos`
--

CREATE TABLE `teachers_videos` (
  `id` int(11) NOT NULL,
  `teacher_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `link` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `teachers_videos`
--

INSERT INTO `teachers_videos` (`id`, `teacher_id`, `ar_name`, `en_name`, `link`, `image`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 'محاضرة ١', 'Lecture 1', 'https://www.google.com/', 'b6ySK.image 16.png', 'yes', '2023-07-25 05:32:52', '2023-07-25 05:32:57');

-- --------------------------------------------------------

--
-- Table structure for table `tutorials`
--

CREATE TABLE `tutorials` (
  `id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_desc` text NOT NULL,
  `en_desc` text NOT NULL,
  `sort` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `active` enum('yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `tutorials`
--

INSERT INTO `tutorials` (`id`, `ar_name`, `en_name`, `ar_desc`, `en_desc`, `sort`, `image`, `active`, `created_at`, `updated_at`) VALUES
(1, 'غرس : بوابة المتبرعين والمتطوعين', 'Ghars: Portal of donors and volunteers', 'تطبيق غرس هو بوابة للمتبرعين والمتطوعين الذين يريدون انفاق زكاتهم في الطريق الصحيح، معنا سنساعدك في توصيل زكاتك الى المكان الاكثر احتياجآ بكل سهولة.', 'Ghars application is a portal for donors and volunteers who want to spend their zakat in the right way, with us we will help you deliver your zakat to the place most in need with ease.', 1, 'KlsLm.larm-rmah-AEaTUnvneik-unsplash 1.png', 'yes', '2023-07-24 09:36:22', '2023-07-24 09:42:49'),
(2, 'غرس : بوابة المتبرعين والمتطوعين', 'Ghars: Portal of donors and volunteers', 'تطبيق غرس هو بوابة للمتبرعين والمتطوعين الذين يريدون انفاق زكاتهم في الطريق الصحيح، معنا سنساعدك في توصيل زكاتك الى المكان الاكثر احتياجآ بكل سهولة.', 'Ghars application is a portal for donors and volunteers who want to spend their zakat in the right way, with us we will help you deliver your zakat to the place most in need with ease.', 2, 'Ogh4q.larm-rmah-AEaTUnvneik-unsplash 1.png', 'yes', '2023-07-24 09:36:22', '2023-07-24 09:43:31');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(10) UNSIGNED NOT NULL,
  `group_id` int(11) NOT NULL,
  `country_id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `whatsapp` varchar(255) NOT NULL,
  `governate` varchar(255) NOT NULL,
  `city` varchar(255) NOT NULL,
  `street` varchar(255) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `active` enum('yes','no','delete','yet') NOT NULL,
  `type` enum('admin','user','company') NOT NULL,
  `token` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `group_id`, `country_id`, `name`, `email`, `password`, `phone`, `whatsapp`, `governate`, `city`, `street`, `ar_name`, `en_name`, `active`, `type`, `token`, `remember_token`, `created_at`, `updated_at`, `deleted_at`) VALUES
(1, 1, 114, 'Ahmed Kamal', 'info@domain.com', '$2y$10$J4pZqApnQLSsvcDZeJ69i.ikO5x9cAOeUTp4Ji7tXHoj94fjsAT86', '50733441', '50733441', 'Hawali', 'Hawali', '1', '', '', 'yes', 'admin', '$2y$10$0hfWGXTtDjp41ytCwX0whuUA7Xp7ltmLUXBSHmwa3yrAqIGnPlKye', 'apltj2RiaqklKrNWuiQOlsw3r1l68eKqkFvQgS8Z2DT9exuWhDhXdSQtHFCF', NULL, '2023-08-02 12:53:09', NULL),
(4, 0, 114, 'test user', 'user@domain.com', '$2y$10$QHKyYnAvRAj/rvMsCn/mF.mE9l1jYefMUfKnsr8mqHDaSBNZtEgDO', '12341234', '12341234', 'حولي', 'حطين', '١٢', '', '', 'yes', 'user', '$2y$10$j4gJZSgJnMem.0sDPn/ipeYVZzXnorP0DMSiuW7gI1WEL7b4aDvc2', NULL, '2023-05-20 09:42:19', '2023-07-25 06:21:40', NULL),
(6, 0, 201, 'محمد علي أحمد', 'company@domain.com', '$2y$10$WOJA5AeYuhr1btmftw2Aje2y4QVx4h2zmRKIC9GwZDDsLCwVDM4wi', '12312312', '12312312', 'الخرطوم', 'ديشتا', '١٣', 'الشركة المتحدة', 'United Company', 'yes', 'company', '', NULL, '2023-05-20 10:57:19', '2023-05-20 11:13:23', NULL),
(7, 0, 1, 'app user', 'user@app.com', '$2y$10$Oh9HbLMFjvV5utmKaac2VecMR/nA5xcCSBKfg.F/1LuiNVltiRFEW', '59733482', '59733482', 'حولي', 'حطين', '19', '', '', 'yes', 'user', '$2y$10$/FlQVMQ5yYfGTeuoX/ion.Q7rtXdsXnvU9VIChNelGkOhTV.nuMSS', NULL, '2023-07-25 06:27:51', '2023-07-25 06:27:51', NULL),
(9, 0, 965, 'test user 4', 'user4@domain.com', '$2y$10$l3jI5F0f4mS8pXT1Yga4MOhKviHSlrbhGITF2iwzV3mkK4997/Z06', '324234234', '34234234', 'dssd', 'fsdf', 'fsdfdf', '', '', 'yes', 'user', '$2y$10$O/qABY1iYWCWKk3xldEjCOwQ94YmzXkhxe11Rduy6OLJjV.lVXNMi', 'oG7zxy7584W4kYRT0TRJ0UWwRtuuXPlSPJYyCbdKGiGQzaFvYaq301YYDbd4', '2023-07-31 11:27:36', '2023-07-31 11:27:36', NULL),
(10, 0, 0, 'fff', 'ddd@gmail.com', '$2y$10$8sWyGuPGUxo0J4ZKLV6qFO02nuJH0r83C1xoo2/FhunVrLSKeUARK', '33333333', '', '', '', '', '', '', 'yes', 'user', '$2y$10$T77Vs4szp2D2MMrQeaET0uX35O56R4NM0Qo/m9WLnQCSPewOu2KNm', NULL, '2023-08-03 14:06:04', '2023-08-03 14:06:04', NULL),
(11, 0, 0, 'eee', 'www@gmail.com', '$2y$10$Hq.bZ9UpyrC86HmJdMGZFOA6xkS.eCzzIOtgCKwvG9p/oqXyNiNXm', '44444444', '', 'country', 'city', 'stret', '', '', 'yes', 'user', '$2y$10$afCRAc.5Qw7v2wuK10grfePAytH0mzKEJDQhwHodIKFdZ6//HzbVq', NULL, '2023-08-03 14:08:05', '2023-08-03 14:08:05', NULL),
(12, 0, 0, 'rrr', 'aa@gmail.com', '$2y$10$fn86S461ER2KU8spcaCxQu7E6J2834rhRS.kt9o8ZuqPUeaorpf0G', '77777777', '22222222', 'gover', 'city', 'street', '', '', 'yes', 'user', '$2y$10$weKu3A5IGskuFUn4FovJj.SwRih6clFi80hzppkQ04lfThBgt..Bm', NULL, '2023-08-03 14:11:16', '2023-08-03 14:11:16', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users_categories`
--

CREATE TABLE `users_categories` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users_categories`
--

INSERT INTO `users_categories` (`id`, `user_id`, `category_id`, `created_at`, `updated_at`) VALUES
(3, 6, 6, '2023-05-20 11:13:23', '2023-05-20 11:13:23'),
(4, 6, 4, '2023-05-20 11:13:23', '2023-05-20 11:13:23');

-- --------------------------------------------------------

--
-- Table structure for table `users_files`
--

CREATE TABLE `users_files` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `file` varchar(255) NOT NULL,
  `active` enum('yes','no','yet') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users_files`
--

INSERT INTO `users_files` (`id`, `user_id`, `ar_name`, `en_name`, `file`, `active`, `created_at`, `updated_at`) VALUES
(1, 6, 'رخصة الشركة', 'Company Licence', 'VGmZL.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'no', '2023-05-20 10:57:19', '2023-05-20 11:12:59'),
(2, 6, 'رخصة الشركة', 'Company Licence', 'hiNGo.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yes', '2023-05-20 10:57:19', '2023-05-20 10:57:19'),
(3, 6, 'رخصة الشركة', 'Company Licence', 'VDk78.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yes', '2023-05-20 10:57:19', '2023-05-20 10:57:19'),
(4, 6, 'ملف', 'file', '2y2gO.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yet', '2023-05-20 16:11:06', '2023-05-20 16:11:06');

-- --------------------------------------------------------

--
-- Table structure for table `users_portfolio`
--

CREATE TABLE `users_portfolio` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `ar_name` varchar(255) NOT NULL,
  `en_name` varchar(255) NOT NULL,
  `ar_desc` text NOT NULL,
  `en_desc` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `active` enum('yet','yes','no') NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users_portfolio`
--

INSERT INTO `users_portfolio` (`id`, `user_id`, `category_id`, `ar_name`, `en_name`, `ar_desc`, `en_desc`, `image`, `active`, `created_at`, `updated_at`) VALUES
(2, 6, 0, 'مشروع ١', 'Project 1', '<p>هنالك العديد من الأنواع المتوفرة لنصوص لوريم إيبسوم، ولكن الغالبية تم تعديلها بشكل ما عبر إدخال بعض النوادر أو الكلمات العشوائية إلى النص. إن كنت تريد أن تستخدم نص لوريم إيبسوم ما، عليك أن تتحقق أولاً أن ليس هناك أي كلمات أو عبارات محرجة أو غير لائقة مخبأة في هذا النص. بينما تعمل جميع مولّدات نصوص لوريم إيبسوم على الإنترنت على إعادة تكرار مقاطع من نص لوريم إيبسوم نفسه عدة مرات بما تتطلبه الحاجة، يقوم مولّدنا هذا باستخدام كلمات من قاموس يحوي على أكثر من 200 كلمة لا تينية، مضاف إليها مجموعة من الجمل النموذجية، لتكوين نص لوريم إيبسوم ذو شكل منطقي قريب إلى النص الحقيقي. وبالتالي يكون النص الناتح خالي من التكرار، أو أي كلمات أو عبارات غير لائقة أو ما شابه. وهذا ما يجعله أول مولّد نص لوريم إيبسوم حقيقي على الإنترنت.</p>', '<p>There are many variations of passages of Lorem Ipsum available, but the majority have suffered alteration in some form, by injected humour, or randomised words which don&#39;t look even slightly believable. If you are going to use a passage of Lorem Ipsum, you need to be sure there isn&#39;t anything embarrassing hidden in the middle of text. All the Lorem Ipsum generators on the Internet tend to repeat predefined chunks as necessary, making this the first true generator on the Internet. It uses a dictionary of over 200 Latin words, combined with a handful of model sentence structures, to generate Lorem Ipsum which looks reasonable. The generated Lorem Ipsum is therefore always free from repetition, injected humour, or non-characteristic words etc.</p>', 'NKyBC.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yes', '2023-05-20 11:57:16', '2023-05-20 12:10:47'),
(3, 6, 0, 'مشروع ٢', 'portfolio 2', '<p>Arabic Portfolio Description</p>', '<p>English Portfolio Description</p>', 'DBFD8.Screen Shot 2023-05-20 at 11.20.07 AM.png', 'yet', '2023-05-20 16:14:44', '2023-05-20 16:14:44');

-- --------------------------------------------------------

--
-- Table structure for table `users_portfolio_images`
--

CREATE TABLE `users_portfolio_images` (
  `id` int(11) NOT NULL,
  `portfolio_id` int(11) NOT NULL,
  `image` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `users_portfolio_images`
--

INSERT INTO `users_portfolio_images` (`id`, `portfolio_id`, `image`, `created_at`, `updated_at`) VALUES
(1, 2, 'co7UM.Screen Shot 2023-05-20 at 11.20.07 AM.png', '2023-05-20 11:57:16', '2023-05-20 11:57:16');

-- --------------------------------------------------------

--
-- Table structure for table `visitors`
--

CREATE TABLE `visitors` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `country_id` int(11) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `visitors`
--

INSERT INTO `visitors` (`id`, `name`, `country_id`, `phone`, `email`, `created_at`, `updated_at`) VALUES
(1, 'Ahmed', 114, '50733441', 'info@domain.com', '2023-08-02 11:20:50', '2023-08-02 11:20:50'),
(2, 'Bbb', 114, '50025649', 'A@gmail.com', '2023-08-05 13:25:52', '2023-08-05 13:25:52'),
(3, 'anas', 114, '50025649', 'anas-nammas@live.com', '2023-08-05 15:06:20', '2023-08-05 15:06:20');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `actions`
--
ALTER TABLE `actions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ads`
--
ALTER TABLE `ads`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `api_key`
--
ALTER TABLE `api_key`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories_steps`
--
ALTER TABLE `categories_steps`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `childern`
--
ALTER TABLE `childern`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `childern_donations`
--
ALTER TABLE `childern_donations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `childern_reports`
--
ALTER TABLE `childern_reports`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contacts`
--
ALTER TABLE `contacts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `countries`
--
ALTER TABLE `countries`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `currencies`
--
ALTER TABLE `currencies`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `donations`
--
ALTER TABLE `donations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `families`
--
ALTER TABLE `families`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `families_donations`
--
ALTER TABLE `families_donations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `families_members`
--
ALTER TABLE `families_members`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `families_reports`
--
ALTER TABLE `families_reports`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `gifts`
--
ALTER TABLE `gifts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `groups`
--
ALTER TABLE `groups`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ideas`
--
ALTER TABLE `ideas`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `newsletters`
--
ALTER TABLE `newsletters`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifications`
--
ALTER TABLE `notifications`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `pages`
--
ALTER TABLE `pages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `projects`
--
ALTER TABLE `projects`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `projects_reports`
--
ALTER TABLE `projects_reports`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `site`
--
ALTER TABLE `site`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `slider`
--
ALTER TABLE `slider`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `social_media`
--
ALTER TABLE `social_media`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teachers_donations`
--
ALTER TABLE `teachers_donations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teachers_reports`
--
ALTER TABLE `teachers_reports`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `teachers_videos`
--
ALTER TABLE `teachers_videos`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tutorials`
--
ALTER TABLE `tutorials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_categories`
--
ALTER TABLE `users_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_files`
--
ALTER TABLE `users_files`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_portfolio`
--
ALTER TABLE `users_portfolio`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users_portfolio_images`
--
ALTER TABLE `users_portfolio_images`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `visitors`
--
ALTER TABLE `visitors`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `actions`
--
ALTER TABLE `actions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=432;

--
-- AUTO_INCREMENT for table `ads`
--
ALTER TABLE `ads`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `api_key`
--
ALTER TABLE `api_key`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `categories_steps`
--
ALTER TABLE `categories_steps`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `childern`
--
ALTER TABLE `childern`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `childern_donations`
--
ALTER TABLE `childern_donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `childern_reports`
--
ALTER TABLE `childern_reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `contacts`
--
ALTER TABLE `contacts`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `countries`
--
ALTER TABLE `countries`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=262;

--
-- AUTO_INCREMENT for table `currencies`
--
ALTER TABLE `currencies`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `donations`
--
ALTER TABLE `donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `families`
--
ALTER TABLE `families`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `families_donations`
--
ALTER TABLE `families_donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `families_members`
--
ALTER TABLE `families_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `families_reports`
--
ALTER TABLE `families_reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `gifts`
--
ALTER TABLE `gifts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `groups`
--
ALTER TABLE `groups`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `ideas`
--
ALTER TABLE `ideas`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=50;

--
-- AUTO_INCREMENT for table `newsletters`
--
ALTER TABLE `newsletters`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `notifications`
--
ALTER TABLE `notifications`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `pages`
--
ALTER TABLE `pages`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3080;

--
-- AUTO_INCREMENT for table `projects`
--
ALTER TABLE `projects`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `projects_reports`
--
ALTER TABLE `projects_reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `site`
--
ALTER TABLE `site`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `slider`
--
ALTER TABLE `slider`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `social_media`
--
ALTER TABLE `social_media`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `teachers`
--
ALTER TABLE `teachers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `teachers_donations`
--
ALTER TABLE `teachers_donations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `teachers_reports`
--
ALTER TABLE `teachers_reports`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `teachers_videos`
--
ALTER TABLE `teachers_videos`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tutorials`
--
ALTER TABLE `tutorials`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `users_categories`
--
ALTER TABLE `users_categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users_files`
--
ALTER TABLE `users_files`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `users_portfolio`
--
ALTER TABLE `users_portfolio`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `users_portfolio_images`
--
ALTER TABLE `users_portfolio_images`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `visitors`
--
ALTER TABLE `visitors`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
